{
    "Idee & Konzept": {
        "EN-US": "Idea & Concept"
    },
    "Out-of the-box Dashboard-Anwendung die nach der Einarbeitung der Idee noch rundum angepasst werden kann.": {
        "EN-US": "Out-of-the-box dashboard application that can be fully customized after the idea has been implemented."
    },
    "Einfache und schnelle Definition von UI-Elementen mittels Python-Dekoratoren und einer klaren Syntax.": {
        "EN-US": "Simple and fast definition of UI elements using Python decorators and a clear syntax."
    },
    "Entwicklung & Erweiterung": {
        "EN-US": "Development & expansion"
    },
    "Integriertes Datenbank-ORM (sqlite) und einfache Datensatzereugung mit angepasster und vereinfachter Peewee-Integration.": {
        "EN-US": "Integrated database ORM (sqlite) and simple data record creation with customized and simplified Peewee integration."
    },
    "Relationale Datenbank-Abfragen mit einer eigenen ``query`` Methode im Model.": {
        "EN-US": "Relational database queries with a separate ``query`` method in the model."
    },
    "Integrierte Standard-Validierung beim speichern eines Datensatzes.": {
        "EN-US": "Integrated standard validation when saving a data record."
    },
    "Erhaltung des Objekt-Orientierten Programmierstils in den Basisklassen, durch Aktionsufruf als Instanzmethoden.": {
        "EN-US": "Preservation of the object-oriented programming style in the base classes, by calling actions as instance methods."
    },
    "Sofort verwendbare Daten-Instanzen im Frontend, nach dem Aktionaufruf im Backend.": {
        "EN-US": "Immediately usable data instances in the frontend, after the action call in the backend."
    },
    "Möglichkeit der Fortschrittsübermittlung bei Aktionen an das Frontend.": {
        "EN-US": "Possibility to transfer the progress of actions to the front end."
    },
    "Automatische relationale Aufarbeitung der darstellbaren Daten im Frontend.": {
        "EN-US": "Automatic relational processing of the displayable data in the front end."
    },
    "Anpassung & Design": {
        "EN-US": "Customization & Design"
    },
    "Einfache Anpassung des Designs durch die Verwendung von Quasar und Vue.js.": {
        "EN-US": "Easy customization of the design through the use of Quasar and Vue.js."
    },
    "Einfache Anpassung der Datenbank-Struktur durch die Verwendung von Peewee.": {
        "EN-US": "Easy customization of the database structure through the use of Peewee."
    },
    "Schnell erstellte Gui-Dashboard-Anwendungen mit Python, die deinen Ideen mehr Freiraum geben.": {
        "EN-US": "Build fast gui dashboard applications with Python that give your ideas more freedom."
    },
    "Get startet": {
        "EN-US": "Get started"
    },
    "Beispiel": {
        "EN-US": "Example"
    },
    "Dokumentation": {
        "EN-US": "Documentation"
    },
    "Test & Stabilität": {
        "EN-US": "Test & stability"
    },
    "Sicherheit & Compliance": {
        "EN-US": "Security & Compliance"
    },
    "Bereitstellung & Veröffentlichung": {
        "EN-US": "Provision & publication"
    },
    "Marketing & Monetarisierung": {
        "EN-US": "Marketing & Monetization"
    },
    "Um deinen Ideen maximale Freiheit zu geben, ist decore Base im ersten Schritt praktisch sofort einsatzbereit. Du musst dich nicht um die GUI, Datenbankfunktionalitäten, Sicherheitsaspekte oder viele andere Details kümmern. Feinere Anpassungen kannst du im nächsten Schritt entsprechend deinen Anforderungen vornehmen. Konzentriere dich vollständig auf deine Ideen und die Umsetzung deiner Algorithmen.": {
        "EN-US": "To give your ideas maximum freedom, decore Base is practically ready to use in the first step. You don't have to worry about the GUI, database functionalities, security aspects or many other details. You can make finer adjustments in the next step according to your requirements. Concentrate fully on your ideas and the implementation of your algorithms."
    },
    "Programmiere deine Anwendung im objektorientierten Stil, denn Benutzer-Aktionen aus dem Frontend werden in deinen Basisinstanzen ausgeführt. Dekoriere einfach Python-Funktionen mit einer klaren Syntax und ermögliche so das organische Wachsen deiner GUI-Anwendung. Erweitere deine Anwendung um neue Funktionen und schöpfe dabei aus dem vollen Potenzial von Python und seinen Bibliotheken.": {
        "EN-US": "Program your application in object-oriented style, because user actions from the frontend are executed in your base instances. Simply decorate Python functions with a clear syntax, allowing your GUI application to grow organically. Extend your application with new functions and draw on the full potential of Python and its libraries."
    },
    "Entdecke mühelos und zügig den grundlegenden UI-Stil und passe ihn anschließend ganz nach deinen Anforderungen an. Integriere zusätzlich Template-Code**, um sicherzustellen, dass deine Anwendung nicht nur Daten verarbeitet, sondern auch ein individuelles Erscheinungsbild annimmt. Verleihe deiner Benutzeroberfläche deinen persönlichen Stil mithilfe eigener Sheets**.": {
        "EN-US": "Easily and quickly discover the basic UI style and then customize it according to your requirements. Integrate additional template code** to ensure that your application not only processes data, but also takes on an individual appearance. Give your user interface your own personal style using your own sheets**."
    },
    "Gewährleiste die Stabilität und Qualität deiner Anwendung durch eine sorgfältige Überprüfung ihrer Funktionalitäten mithilfe eingebauter Testmethoden**. Diese Tests ermöglichen es, die erwarteten Ergebnisse sicherzustellen und die Performance der Anwendung zu optimieren.": {
        "EN-US": "Ensure the stability and quality of your application by carefully checking its functionalities using built-in test methods**. These tests make it possible to ensure the expected results and optimize the performance of the application."
    },
    "Nutze das eingebaute Sitzungsmanagement und übertrage Daten verschlüsselt** in deine Anwendung. Implementiere eigene Modelle für die Erfassung sensibler und persönlicher Benutzerdaten. Setze die integrierte Benutzerverwaltung** ein, um Rollen und Besitzrechte zu verwalten.": {
        "EN-US": "Use the built-in session management and transfer encrypted data** to your application. Implement your own models for capturing sensitive and personal user data. Use the integrated user administration** to manage roles and ownership rights."
    },
    "decore Base wird auch in dieser Entwicklungsphase künftig unterstützende Funktionen bieten. Bald werden Features wie die Electron-Integration** verfügbar sein, mit der du deine Anwendung ganz einfach als Desktop-App veröffentlichen kannst.": {
        "EN-US": "decore Base will also offer supporting functions in this development phase in the future. Features such as Electron integration** will soon be available, allowing you to easily publish your application as a desktop app."
    },
    "Gewährleiste die Sichtbarkeit und Auffindbarkeit deiner Anwendung durch ein SEO**-freundliches Frontend. Baldige Implemetierungen berücksichtigen subtile und benutzerfreundliche Werbemöglichkeiten**, die nahtlos in das Anwendererlebnis integriert sind.": {
        "EN-US": "Ensure the visibility and findability of your application through an SEO**-friendly frontend. Soon implementations will include subtle and user-friendly advertising options** that are seamlessly integrated into the user experience."
    },
    "Zentrale dedizierte Ablage von wiederverwendbaren oder versalzenen Kennwörter mit integriertem Sicherheitsleitfaden**": {
        "EN-US": "Centralized dedicated storage of reusable or salted passwords with integrated security guide**"
    },
    "Out-of-the-box Dashboard-Anwendung die nach der Einarbeitung der Idee noch rundum angepasst werden kann.": {
        "EN-US": "Out-of-the-box dashboard application that can be fully customized after the idea has been implemented."
    },
    "Schneller Einstieg in die Entwicklung und einfache Vorbereitung der Entwicklungsumgebung.": {
        "EN-US": "Fast entry into Development and easy preparation of the development environment."
    },
    "Wandelbare Seitenansichten durch die Möglichkkeit HTML Templates zu verwenden**.": {
        "EN-US": "Changeable page views thanks to the possibility of using HTML templates**."
    },
    "Anpassung der Darstellungen und Reihenfolgen im Layout": {
        "EN-US": "Customization of displays and sequences in the layout"
    },
    "Integrierte Standard-Validierung auf Basis der Feldattribute, beim Speichern eines Datensatzes.": {
        "EN-US": "Integrated standard validation based on the field attributes when saving a data record."
    },
    "Erweiterbare und benutzerdefinierte Validierungsregeln auf Basis von Cerberus-Schemata**.": {
        "EN-US": "Extensible and user-defined validation rules based on Cerberus schemas**."
    },
    "Integriete Log, Test und Messfunktionialität**.": {
        "EN-US": "Integral log, test and measurement functionality**."
    },
    "Integriertes Sitzungssystem mit vorkonfektionierter Benutzer- und Rechteverwaltung.": {
        "EN-US": "Integrated session system with preconfigured user and rights management."
    },
    "Sichere Übertragung von Backend zum Frontend**.": {
        "EN-US": "Secure transfer from backend to frontend**."
    },
    "Zentrale dedizierte Ablage von wiederverwendbaren oder versalzenen Kennwörter mit integriertem Sicherheitsleitfaden**.": {
        "EN-US": "Centralized dedicated storage of reusable or salted passwords with integrated security guide**."
    },
    "Der Standard-Veröffentlichungstyp während der Entwicklung, beim Debuggen und nach Fertigstellung ist die Browseranwendung.": {
        "EN-US": "The default publication type during development, debugging and after completion is the browser application."
    },
    "Möglichkeit der Erstellung von Standalone-Desktop-Anwendungen für Windows mit Electron**.": {
        "EN-US": "Ability to build standalone desktop applications for Windows with Electron**."
    },
    "Die Vielfalt von Anwendungsarten und -zwecken, die mit decore Base umgesetzt werden können, eröffnen ebenso zahlreiche Möglichkeiten zur Monetarisierung.": {
        "EN-US": "The variety of application types and purposes that can be implemented with decore Base also opens up numerous opportunities for monetization."
    },
    "Subtile und nahtlose Möglichkeit Werbung zu schalten**.": {
        "EN-US": "Subtle and seamless way to advertise**."
    },
    "Gewährleiste die Sichtbarkeit und Auffindbarkeit deiner Anwendung durch ein SEO**-freundliches Frontend. Baldige Implemetierungen berücksichtigen subtile und benutzerfreundliche Werbemöglichkeiten**, die nahtlos in das Anwendererlebnis integriert sind und die Vielzahl der Anwendungsmöglichkeiten die decore Base mitbringt, bieten auch viele Möglichkeiten der Monetarisierung**.": {
        "EN-US": "Ensure the visibility and findability of your application through an SEO**-friendly frontend. Soon implementations will consider subtle and user-friendly advertising opportunities** that are seamlessly integrated into the user experience and the variety of application possibilities that decore Base brings also offer many opportunities for monetization**."
    },
    "Kern & Konzept": {
        "EN-US": "Core & Concept"
    }
}