{
    "Dokumentation": {
        "EN-US": "Documentation",
        "ES": "Documentación"
    },
    "Um mit decore Base eine lauffähige GUI-Dashboard-Anwendung zu erstellen, sind vergleichsweise wenige Schritte notwendig. Im Wesentlichen besteht der Aufbau aus der Definition der Meta-Instanzen und der Definition des Datenmodells. Die Metadaten werden vom Interpreter durch Einlesen von dekorierten Funktionen zusammengestellt und als Instanzen im Pool gespeichert.": {
        "EN-US": "To create an executable GUI dashboard application with decore Base, comparatively few steps are necessary. Essentially, the structure consists of defining the meta instances and defining the data model. The metadata is compiled by the interpreter by reading in decorated functions and stored as instances in the pool.",
        "ES": "Para crear una aplicación de cuadro de mando GUI ejecutable con decore Base, son necesarios comparativamente pocos pasos. Esencialmente, la estructura consiste en definir las meta instancias y definir el modelo de datos. Los metadatos son compilados por el intérprete mediante la lectura de funciones decoradas y guardados como instancias en el pool."
    },
    "Beschreibung der Meta-Instanzen": {
        "EN-US": "Description of the meta instances",
        "ES": "Descripción de las metainstancias"
    },
    "Meta-Instanzen entahlten die benötigten Typen und Attribute für die Erstellung der GUI-Elemente. Die Meta-Instanzen werden in der Regel durch dekorierte Funktionen erstellt.": {
        "EN-US": "Meta instances contain the types and attributes required to Build the GUI elements. The meta instances are usually built using decorated functions.",
        "ES": "Las metainstancias contienen los tipos y atributos necesarios para crear los elementos GUI. Las metainstancias suelen crearse mediante funciones decoradas."
    },
    "App": {
        "EN-US": "App",
        "ES": "Aplicación"
    },
    "Die Application-Instanz liefert die Metadaten für den Anwendung. Sie ist die Wurzel für alles kommende und nimmt nur Basen auf. Die App-Instanz wird durch den \"Decorator\" :meth:`app() <decore_Base.decore_base.decore.Decore.app>` erstellt.": {
        "EN-US": "The application instance provides the metadata for the application. It is the root for everything to come and only accepts Bases. The app instance is built by the \"Decorator\" :meth:`app() <decore_Base.decore_base.decore.Decore.app>`.",
        "ES": "La instancia de aplicación proporciona los metadatos de la aplicación. Es la raíz de todo lo que vendrá y sólo acepta bases. La instancia de aplicación se crea mediante el \"Decorator\" :meth:`app() <decore_Base.decore_base.decore.Decore.app>`."
    },
    "Base": {
        "EN-US": "Base",
        "ES": "Base"
    },
    "Die Base-Instanz liefert die Metadaten für die Basis. Sie ist das Trägerelement für die Ansichten. Die Base-Instanz wird durch den \"Decorator\" :meth:`base() <decore_Base.decore_base.decore.Decore.base>` erstellt.": {
        "EN-US": "The Base instance provides the metadata for the Base. It is the carrier element for the Views. The base instance is built by the \"Decorator\" :meth:`base() <decore_Base.decore_base.decore.Decore.base>`.",
        "ES": "La instancia base proporciona los metadatos para la base. Es el elemento portador de las vistas. La instancia base se crea mediante el \"Decorator\" :meth:`base() <decore_Base.decore_base.decore.Decore.base>`."
    },
    "**Darstellung im Frontend**": {
        "EN-US": "**Display in the frontend**",
        "ES": "**Visualización en la parte frontal**"
    },
    "Die Basis ist im Grunde die freie Fläche die für die Ansichten zur Verfügung steht.": {
        "EN-US": "The Base is basically the free area available for the Views.",
        "ES": "La base es básicamente la zona libre que queda disponible para las vistas."
    },
    "In der Navigation wird sie direkt unter Wurzel gelistet sobald sie mehr als eine Ansicht erhält.": {
        "EN-US": "It is listed directly under Root in the navigation as soon as it receives more than one View.",
        "ES": "Aparece directamente debajo de Raíz en la navegación en cuanto recibe más de una vista."
    },
    "View": {
        "EN-US": "View",
        "ES": "Ver"
    },
    "Die View-Instanz liefert die Metadaten für die Ansicht. Ihr können Aktionen und Dialoge untergeordnet werden. Die View-Instanz wird durch den \"Decorator\" :meth:`view() <decore_Base.decore_base.decore.Decore.view>` erstellt.": {
        "EN-US": "The View instance provides the metadata for the View. Actions and dialogs can be subordinated to it. The view instance is built by the \"Decorator\" :meth:`view() <decore_Base.decore_base.decore.Decore.view>`.",
        "ES": "La instancia de vista proporciona los metadatos de la vista. A ella se pueden subordinar acciones y diálogos. La instancia de vista se crea mediante el \"Decorador\" :meth:`view() <decore_Base.decore_base.decore.Decore.view>`."
    },
    "Die unterschiedlichen Ansichts-Typen werden im Bereich :doc:`Typen<documentation/types>` näher beschrieben.": {
        "EN-US": "The different View types are described in more detail in the :doc:`Types<documentation/types>` section.",
        "ES": "Los distintos tipos de vistas se describen con más detalle en la sección :doc:`Tipos<documentación/tipos>`."
    },
    "Die Ansicht wird in der Navigation unter der Basis gelistet.": {
        "EN-US": "The View is listed in the navigation under Base.",
        "ES": "La vista aparece en la navegación bajo la base."
    },
    "Die Ansicht wird im Ansichtsbereich der Basis gerendert.": {
        "EN-US": "The View is rendered in the Base view area.",
        "ES": "La vista se renderiza en el área de vista de la base."
    },
    "Dialog": {
        "EN-US": "Dialog",
        "ES": "Diálogo"
    },
    "Die Dialog-Instanz liefert die Metadaten für den Dialog. Ihr können weitere Dialoge untergeordnet werden die dann in Tabs dargetellt werden. Hauptsächlich dienen diese aber zum tragen der Widgets. Die Dialog-Instanz wird durch den \"Decorator\" :meth:`dialog() <decore_Base.decore_base.decore.Decore.dialog>` erstellt.": {
        "EN-US": "The dialog instance provides the metadata for the dialog. Further dialogs can be subordinated to it, which are then displayed in tabs. However, these are mainly used to carry the widgets. The dialog instance is built by the \"Decorator\" :meth:`dialog() <decore_Base.decore_base.decore.Decore.dialog>`.",
        "ES": "La instancia de diálogo proporciona los metadatos del diálogo. Se le pueden subordinar otros diálogos, que se muestran en pestañas. Sin embargo, éstas se utilizan principalmente para llevar los widgets. La instancia de diálogo se crea mediante el \"Decorador\" :meth:`dialog() <decore_Base.decore_base.decore.Decore.dialogue>`."
    },
    "Auch hier gibt es verschiedene Dialog-Typen die im Bereich :doc:`Typen<documentation/types>` näher beschrieben werden.": {
        "EN-US": "Here, too, there are various dialog types which are described in more detail in the :doc:`Types<documentation/types>` section.",
        "ES": "Aquí también hay varios tipos de diálogo que se describen con más detalle en la sección :doc:`Tipos<documentación/tipos>`."
    },
    "Der Dialog kann in unterschiedlichen Display-Modis dargestellt werden. Zum Beispiel als Side-Drawer oder als modales Fenster.": {
        "EN-US": "The dialog can be shown in different display modes. For example, as a side-drawer or as a modal window.",
        "ES": "El diálogo puede mostrarse en diferentes modos de visualización. Por ejemplo, como ventana lateral o como ventana modal."
    },
    "Dieser wird durch die mit dem Aktivator-Attribut bestimmten Postionen oder Ereignisse aufgerufen.": {
        "EN-US": "This is called up by the positions or events defined with the activator attribute.",
        "ES": "Es llamado por las posiciones o eventos definidos con el atributo activador."
    },
    "Widget": {
        "EN-US": "Widget",
        "ES": "Widget"
    },
    "Die Widget-Instanz liefert die Metadaten für das Widget. Ihr können weitere Widgets untergeordnet werden die dann gestapelt dargetellt werden. Ein Widget wird für die Manipulation des Datensatzes oder Datensätze benötigt. Die Widget-Instanz wird durch den \"Decorator\" :meth:`widget() <decore_Base.decore_base.decore.Decore.widget>` erstellt.": {
        "EN-US": "The widget instance provides the metadata for the widget. Further widgets can be subordinated to it, which are then displayed in a stack. A widget is required for manipulating the data set or data sets. The widget instance is built by the \"Decorator\" :meth:`widget() <decore_Base.decore_base.decore.Decore.widget>`.",
        "ES": "La instancia del widget proporciona los metadatos del widget. Se le pueden subordinar otros widgets, que se mostrarán en una pila. Se necesita un widget para manipular el conjunto o conjuntos de datos. La instancia de widget se crea mediante el \"Decorador\" :meth:`widget() <decore_Base.decore_base.decore.Decore.widget>`."
    },
    "Widgets können beispielsweise ein Editor ein Viewer, Listen, oder Diagramme sein. Die unterschiedlichen Widget-Typen werden im Bereich :doc:`Typen<documentation/types>` näher beschrieben.": {
        "EN-US": "Widgets can be, for example, an editor, a viewer, lists or diagrams. The different widget types are described in more detail in the :doc:`Types<documentation/types>` section.",
        "ES": "Los widgets pueden ser un editor, un visor, listas o diagramas, por ejemplo. Los distintos tipos de widgets se describen con más detalle en la sección :doc:`Tipos<documentación/tipos>`."
    },
    "Das Widget wird im Content-Bereich des Dialoges dargestellt.": {
        "EN-US": "The widget is displayed in the content area of the dialog.",
        "ES": "El widget se muestra en el área de contenido del diálogo."
    },
    "Action": {
        "EN-US": "Action",
        "ES": "Acción"
    },
    "Die Action-Instanz liefert die Metadaten für die Aktion. Sie ist das Schlußlicht in der Prozesskette der Meta-Abarbeitung und dient zum übermitteln der Manipulationen und der Ausführung von Aktionen im Backend. Die Action-Instanz wird durch den \"Decorator\" :meth:`action() <decore_Base.decore_base.decore.Decore.action>` erstellt.": {
        "EN-US": "The action instance provides the metadata for the action. It is the last link in the meta processing chain and is used to transmit the manipulations and Run actions in the backend. The action instance is built by the \"Decorator\" :meth:`action() <decore_Base.decore_base.decore.Decore.action>`.",
        "ES": "La instancia de acción proporciona los metadatos de la acción. Es el último eslabón de la cadena de metaprocesamiento y se utiliza para transmitir las manipulaciones y la ejecución de acciones en el backend. La instancia de acción se crea mediante el \"Decorator\" :meth:`action() <decore_Base.decore_base.decore.Decore.action>`."
    },
    "Auch Aktionen haben Typen die im Bereich :doc:`Typen<documentation/types>` näher beschrieben werden. Ein Besispiel wäre der Typ ``submit`` der bestimmte Daten (z.B. Item, Selektierte Items oder Strukturen) an das Backend übermittelt.": {
        "EN-US": "Actions also have types that are described in more detail in the :doc:`Types<documentation/types>` section. An example would be the type ``submit`` which transmits certain data (e.g. item, selected items or structures) to the backend.",
        "ES": "Las acciones también tienen tipos que se describen con más detalle en la sección :doc:`Types<documentation/types>`. Un ejemplo sería el tipo ``submit`` que transmite ciertos datos (por ejemplo, elemento, elementos seleccionados o estructuras) al backend."
    },
    "Aktionen können durch das Aktivator-Attribut an unterschiedlichen Stellen im Frontend positioniert werden, haben aber keine tatächliche Darstellung sondern nur Schaltflächen- oder Ereignisgesteuerte Trigger.": {
        "EN-US": "Actions can be positioned in different places in the frontend using the activator attribute, but have no actual display, only button or event-controlled triggers.",
        "ES": "Las acciones pueden posicionarse en diferentes lugares del frontend utilizando el atributo activator, pero no tienen una visualización real, sólo activadores controlados por botones o eventos."
    },
    "Function": {
        "EN-US": "Function",
        "ES": "Función"
    },
    "Die Function-Instanz liefert die Metadaten für Funktionen die nach dem Init des Pools direkt in der Base als Instanz-Methoden ausgeführt werden. Die Function-Instanz wird durch den \"Decorator\" :meth:`function() <decore_Base.decore_base.decore.Decore.function>` erstellt.": {
        "EN-US": "The function instance provides the metadata for functions that are run directly in the base as instance methods after the pool init. The function instance is built by the \"Decorator\" :meth:`function() <decore_Base.decore_base.decore.Decore.function>`.",
        "ES": "La instancia de función proporciona los metadatos para las funciones que se ejecutan directamente en la base como métodos de instancia después del pool init. La instancia de función se crea mediante el \"Decorator\" :meth:`function() <decore_Base.decore_base.decore.Decore.function>`."
    },
    "Funktionen werden nicht im Frontend dargestellt oder aufgearbeitet.": {
        "EN-US": "Functions are not displayed or processed in the front end.",
        "ES": "Las funciones no se visualizan ni se procesan en el front end."
    },
    "Abarbeitungsreihenfolge im Frontend": {
        "EN-US": "Processing sequence in the frontend",
        "ES": "Secuencia de procesamiento en el frontend"
    },
    "Nach dem Öffnen einer Anwendung, dem Anlegen der Base und dem Anlegen weiterer Childs laufen alle Pfade auf die Action zu, die schließlich wieder mit dem Backend kommuniziert, um die Manipulation der Daten zu ermöglichen. Nicht jedes Komponentenobjekt kann einem anderen beliebig zugeordnet werden. Das Frontend arbeitet die einzelnen Objekte nur in einer festen Reihenfolge ab.": {
        "EN-US": "After opening an application, creating the base and creating further children, all paths lead to the action, which then communicates with the backend again to enable the data to be manipulated. Not every component object can be arbitrarily assigned to another. The frontend only processes the individual objects in a fixed order.",
        "ES": "Tras abrir una aplicación, crear la base y crear más hijos, todos los caminos conducen a la acción, que vuelve a comunicarse con el backend para permitir la manipulación de los datos. No todos los objetos componentes pueden asignarse arbitrariamente a otro. El front end sólo procesa los objetos individuales en un orden fijo."
    },
    "Diese Übersicht stellt den Prozess dieser Abarbeitung dar.": {
        "EN-US": "This overview shows the process of this processing.",
        "ES": "Este resumen muestra el proceso de este tratamiento."
    },
    "Relationale Datenverarbeitung im Widget": {
        "EN-US": "Relational data processing in the widget",
        "ES": "Tratamiento relacional de datos en el widget"
    },
    "Die Datenverarbeitung und Datensatzgenerierung in den Widgets ist ein wichtiger Bestandteil der Anwendung und wird hier als Relationale-Datenverarbeitung bezeichnet. Diese Generierung des bearbeitbaren Datensatzes, wird erstens durch den Aktivator und zweitens durch die Datenquelle der Ansicht in Beziehung zur Datenquelle des Widgets gesteuert. Damit wird ermöglicht, einen Dialog mit weiter im Kontext der eigentlichen Selektion zu erweitern und detailreicher zu gestalten.": {
        "EN-US": "Data processing and data set generation in the widgets is an important part of the application and is referred to here as relational data processing. This generation of the editable data set is controlled firstly by the activator and secondly by the data source of the View in relation to the data source of the widget. This makes it possible to extend a dialog with further in the context of the actual selection and to make it more detailed.",
        "ES": "El tratamiento de datos y la generación de conjuntos de datos en los widgets es una parte importante de la aplicación y se denomina aquí tratamiento relacional de datos. Esta generación del conjunto de datos editables está controlada en primer lugar por el activador y en segundo lugar por la fuente de datos de la vista en relación con la fuente de datos del widget. Esto permite ampliar un diálogo con más en el contexto de la selección real y hacerlo más detallado."
    },
    "Folgender Chart beschreibt diesen Prozess.": {
        "EN-US": "The following chart describes this process.",
        "ES": "El siguiente cuadro describe este proceso."
    },
    "Legende:": {
        "EN-US": "Legend:",
        "ES": "Leyenda:"
    },
    "**Item**": {
        "EN-US": "**Item**",
        "ES": "**Artículo**"
    },
    "empty = ein leerer Datensatz wird generiert. (keine Default-Werte).": {
        "EN-US": "empty = an empty data record is generated. (no default values).",
        "ES": "empty = se genera un registro de datos vacío. (sin valores por defecto)."
    },
    "first = der erste Datensatz der Widget-Quelle wird als Datensatz geladen.": {
        "EN-US": "first = the first data record of the widget source is loaded as a data record.",
        "ES": "first = el primer registro de datos de la fuente del widget se carga como un registro de datos."
    },
    "last = der letzte Datensatz der Widget-Quelle wird als Datensatz geladen.": {
        "EN-US": "last = the last data record of the widget source is loaded as a data record.",
        "ES": "last = el último registro de datos de la fuente del widget se carga como un registro de datos."
    },
    "default = ein neuer Datensatz mit Default-Werten der Widget-Quelle wird als Datensatz geladen.": {
        "EN-US": "default = a new data set with default values from the widget source is loaded as a data set.",
        "ES": "default = un nuevo conjunto de datos con valores por defecto de la fuente del widget se carga como un conjunto de datos."
    },
    "item_by_id = ein Datensatz mit einer definierten ID aus der Widget-Quelle wird als Datensatz geladen.": {
        "EN-US": "item_by_id = a data record with a defined ID from the widget source is loaded as a data record.",
        "ES": "item_by_id = un registro de datos con un ID definido de la fuente del widget se carga como un registro de datos."
    },
    "**Query**": {
        "EN-US": "**Query**",
        "ES": "**Consulta**"
    },
    "True = Alle vorkommenden Backref-Namen und die ID des selektierten Datensatzes der Ansichts-Quelle wird genutzt, um die Query des Widgets zu erweitern.": {
        "EN-US": "True = All occurring backref names and the ID of the selected data set of the View source are used to expand the widget's query.",
        "ES": "True = Todos los nombres de referencia que aparecen y el ID del registro de datos seleccionado de la fuente de la vista se utilizan para ampliar la consulta del widget."
    },
    "False = Die ID des selektierten Datensatzes wird nicht als Query-Attribut für den Datenabruf verwendet.": {
        "EN-US": "False = The ID of the selected data record is not used as a query attribute for the data retrieval.",
        "ES": "Falso = El ID del registro de datos seleccionado no se utiliza como atributo de consulta para la recuperación de datos."
    },
    "**Extend**": {
        "EN-US": "**Extend**",
        "ES": "**Extender**"
    },
    "True = automatische Befüllung der relationalen Felder des Ziel-Datensatzes, mit dem Ansichts-Datensatz. Zum Beispiel: Ein ForeignKey-Feld des Ziel-Datanstaz wird mit dem Ansichst-Datenstaz befüllt.": {
        "EN-US": "True = automatic filling of the relational fields of the target data set with the View data set. For example: A ForeignKey field of the target dataset is filled with the view dataset.",
        "ES": "Verdadero = relleno automático de los campos relacionales del conjunto de datos de destino con el conjunto de datos de la vista. Por ejemplo: un campo ForeignKey del conjunto de datos de destino se rellena con el conjunto de datos de la vista."
    },
    "False = keine automatische Befüllung des Datensatzes.": {
        "EN-US": "False = no automatic filling of the data record.",
        "ES": "Falso = no se rellena automáticamente el registro de datos."
    },
    "Decorators": {
        "EN-US": "Decorators",
        "ES": "Decoradores"
    },
    "Objekt der Klasse Decore ist die Hauptklasse des Frameworks. Sie ist für die Registrierung der Elemente zuständig und stellt die API zur Verfügung.": {
        "EN-US": "Object of class Decore is the main class of the framework. It is responsible for registering the elements and provides the API.",
        "ES": "Objeto de clase Decore es la clase principal del framework. Se encarga de registrar los elementos y proporciona la API."
    },
    "Eine Funktion zum eröffnen einer GUI-Dashboard-Anwendung. Sie wird als \"Decorator\" verwendet.": {
        "EN-US": "A function for opening a GUI dashboard application. It is used as a \"Decorator\".",
        "ES": "Una función para abrir una aplicación de cuadro de mando GUI. Se utiliza como \"Decorador\"."
    },
    "Parameters": {
        "EN-US": "Parameters"
    },
    "Der Titel der App.": {
        "EN-US": "The title of the app.",
        "ES": "El título de la aplicación."
    },
    "Gibt an, ob der Gastzugang (Anonynus) erlaubt ist. Der Wert ``True`` erlaubt den automatischen Login als Gast. Der Wert ``False`` verweigert das senden der Metadaten an das Frontend und verweist auf die Login-Seite.": {
        "EN-US": "Specifies whether guest access (anonynus) is permitted. The value ``True`` allows automatic login as a guest. The value ``False`` refuses to send the metadata to the frontend and refers to the login page.",
        "ES": "Especifica si se permite el acceso de invitados (anonynus). El valor ``True`` permite el inicio de sesión automático como invitado. El valor ``False`` rechaza enviar los metadatos al frontend y remite a la página de inicio de sesión."
    },
    "Eine Funktion zum registrieren einer Basis in der GUI-Dashboard-Anwendung. Sie wird als \"Decorator\" verwendet.": {
        "EN-US": "A function for registering a Base in the GUI dashboard application. It is used as a \"Decorator\".",
        "ES": "Una función para registrar una base en la aplicación GUI dashboard. Se utiliza como un \"Decorador\"."
    },
    "Die Basis ist das Trägerelement für die Ansicht und die Vorlage für die Datenquelle im Frontend.": {
        "EN-US": "Base is the carrier element for the View and the template for the data source in the frontend.",
        "ES": "La base es el elemento portador para la vista y la plantilla para la fuente de datos en el front-end."
    },
    "Das Symbol der Basis.": {
        "EN-US": "The symbol of the Base.",
        "ES": "El símbolo de la base."
    },
    "Der Titel der Basis.": {
        "EN-US": "The Base title.",
        "ES": "El título de la base."
    },
    "Die Beschreibung der Basis.": {
        "EN-US": "The description of the Base.",
        "ES": "La descripción de la base."
    },
    "Das Datenmodell der Basis.": {
        "EN-US": "The Base data model.",
        "ES": "El modelo de datos de la base."
    },
    "Eine Funktion zur Registrierung einer Ansicht. Sie wird als \"Decorator\" verwendet.": {
        "EN-US": "A function for registering a View. It is used as a \"Decorator\".",
        "ES": "Una función para registrar una vista. Se utiliza como \"Decorador\"."
    },
    "Eine Ansicht ist ein Container für die Anzeige von Daten.": {
        "EN-US": "A View is a container for displaying data.",
        "ES": "Una vista es un contenedor para mostrar datos."
    },
    "Die ID des übergeordneten Elements. Nur zu setzen, wenn die Ansicht in einer anderen Basis gerendert werden soll.": {
        "EN-US": "The ID of the parent element. Only to be set if the View is to be rendered in a different Base.",
        "ES": "El ID del elemento padre. Sólo debe establecerse si la vista se va a renderizar en una base diferente."
    },
    "Das Symbol der Ansicht.": {
        "EN-US": "The View icon.",
        "ES": "El símbolo de la vista."
    },
    "Der Titel der Ansicht.": {
        "EN-US": "The title of the View.",
        "ES": "El título de la vista."
    },
    "Die Beschreibung der Ansicht.": {
        "EN-US": "The description of the View.",
        "ES": "La descripción de la vista."
    },
    "Gibt an wie die Datensätze angezeigt werden. Der Wert ``table`` stellt die Datensätze in einer Tabelle dar.": {
        "EN-US": "Specifies how the data records are displayed. The value ``table`` represents the data records in a table.",
        "ES": "Especifica cómo se muestran los registros de datos. El valor ``table`` representa los registros de datos en una tabla."
    },
    "Die Felder, die in der Ansicht angezeigt werden.": {
        "EN-US": "The fields that are displayed in the View.",
        "ES": "Los campos que se muestran en la vista."
    },
    "Die Filter, die in der Ansicht angezeigt werden.": {
        "EN-US": "The filters that are displayed in the View.",
        "ES": "Los filtros que se muestran en la vista."
    },
    "Die Abfrage, die in der Ansicht angezeigt wird.": {
        "EN-US": "The query that is displayed in the View.",
        "ES": "La consulta que se muestra en la vista."
    },
    "Wählt die Methode wie die Datensätze der View geladen werden. Der Wert ``client`` lädt alle Datensätze auf einmal und überlässt den Seitenaufbau dem Frontend.": {
        "EN-US": "Selects the method how the data records of the view are loaded. The value ``client`` loads all data records at once and leaves the page structure to the frontend.",
        "ES": "Selecciona el método para cargar los registros de datos de la vista. El valor ``client`` carga todos los registros de datos a la vez y deja la estructura de la página al frontend."
    },
    "Gibt an wieviele Datensätze auf einer Seite der Ansicht angezeigt werden sollen. ``16`` ist die Standardeinstellung.": {
        "EN-US": "Specifies how many data records should be displayed on one page of the View. ``16`` is the default setting.",
        "ES": "Especifica cuántos registros de datos deben mostrarse en una página de la vista. ``16`` es el valor predeterminado."
    },
    "Eine Funktion zur Registrierung eines Dialogs. Sie wird als \"Decorator\" verwendet.": {
        "EN-US": "A function for registering a dialog. It is used as a \"Decorator\".",
        "ES": "Función para registrar un diálogo. Se utiliza como \"Decorador\"."
    },
    "Der Dialog ist das Trägerelement für Widgets": {
        "EN-US": "The dialog is the carrier element for widgets",
        "ES": "El diálogo es el elemento portador de los widgets"
    },
    "Die ID des übergeordneten Elements. Nur zu setzen, wenn der Dialog in einer Ansicht einer anderen Basis gerendert werden soll.": {
        "EN-US": "The ID of the parent element. Only to be set if the dialog is to be rendered in a View of another Base.",
        "ES": "El ID del elemento padre. Sólo debe establecerse si el diálogo se va a representar en una vista de otra base."
    },
    "Das Symbol des Dialogs.": {
        "EN-US": "The symbol of dialog.",
        "ES": "El símbolo del diálogo."
    },
    "Der Titel des Dialogs.": {
        "EN-US": "The title of the dialog.",
        "ES": "El título del diálogo."
    },
    "Die Beschreibung des Dialogs.": {
        "EN-US": "The description of the dialog.",
        "ES": "La descripción del diálogo."
    },
    "Gibt an wie der Dialog die Widgets darstellen wird. Der Wert ``standard`` stellt die untergeordneten Widgets und Sub-Widgets untereinander dar.": {
        "EN-US": "Specifies how the dialog will display the widgets. The ``standard`` value displays the subordinate widgets and sub-widgets one below the other.",
        "ES": "Especifica cómo mostrará el diálogo los widgets. El valor ``estándar`` muestra los widgets y sub-widgets subordinados uno debajo de otro."
    },
    "Der Anzeigetyp des Dialogs. Standardwert ist ``draw-half``.": {
        "EN-US": "The display type of the dialog. The default value is ``draw-half``.",
        "ES": "Tipo de visualización del diálogo. El valor por defecto es ``draw-half``."
    },
    "Der Aktivatortyp des Dialogs. Über den Wert ``none`` wird der Dialog sofort beim OnLoad Ereignis der View angezeigt. Der Wert ``default`` stellt den Dialog im Top-Menu der View dar. Der Wert ``context`` stellt den Dialog im Kontextmenü eines Items der View dar. Der Wert ``click`` zeigt den Dialog dann an wenn man einen Datensatz anklickt.": {
        "EN-US": "The activator type of the dialog. With the value ``none`` the dialog is displayed immediately at the OnLoad event of the view. The value ``default`` displays the dialog in the top menu of the view. The value ``context`` represents the dialog in the context menu of an item in the view. The value ``click`` displays the dialog when you click on a data record.",
        "ES": "El tipo de activador del diálogo. Con el valor ``none`` el diálogo se muestra inmediatamente en el evento OnLoad de la vista. El valor ``default`` muestra el diálogo en el menú superior de la vista. El valor ``context`` representa el diálogo en el menú contextual de un elemento de la vista. El valor ``click`` muestra el diálogo cuando se hace clic sobre un registro de datos."
    },
    "Eine Funktion zur Registrierung eines Widgets. Sie wird als \"Decorator\" verwendet.": {
        "EN-US": "A function for registering a widget. It is used as a \"Decorator\".",
        "ES": "Una función para registrar un widget. Se utiliza como \"Decorador\"."
    },
    "Ein Widget dient zur Darstellung und Interaktion mit dem Datensatz. Es erhält die Daten, die der Dialog-Aktivator vorgibt. Der Wert ``none`` übergibt den letzten Datensatz der Datenbanktabelle. Der Wert ``default`` übergibt einen nur mit Default-Werten gefüllten Datensatz. Beim Wert ``context`` übergibt es den Datensatz, der im Kontextmenü der Ansicht ausgewählt wurde. Und ``click`` übergibt den Datensatz, der angeklickt wurde.": {
        "EN-US": "A widget is used to display and interact with the data set. It receives the data specified by the dialog activator. The value ``none`` transfers the last data record of the database table. The value ``default`` transfers a data record filled only with default values. The value ``context`` transfers the data record that was selected in the context menu of the View. And ``click`` transfers the data record that was clicked on.",
        "ES": "Un widget se utiliza para mostrar e interactuar con el conjunto de datos. Recibe los datos especificados por el activador del diálogo. El valor ``none`` transfiere el último registro de datos de la tabla de la base de datos. El valor ``default`` transfiere un registro de datos rellenado sólo con valores por defecto. El valor ``context`` transfiere el registro de datos seleccionado en el menú contextual de la vista. Y ``click`` transfiere el registro de datos sobre el que se ha hecho clic."
    },
    "Widgets, welche aus einer fremden Basis einem Dialog zugeordnet werden, ergänzen die relationalen Felder eines Default-Items der fremden Datenquelle mit den Daten des aktivierten Items. (Der Satz ist Scheiße zu verstehen, aber er trifft genau das, was es tut). In der Sample Anwendung verwende ich das beim Zuweisen von \"Contracts\" zu einer \"Person\".": {
        "EN-US": "Widgets, which are assigned to a dialog from a foreign Base, supplement the relational fields of a default item of the foreign data source with the data of the activated item. (The sentence is crap to understand, but it does exactly what it does). In the sample application, I use this when assigning \"Contracts\" to a \"Person\".",
        "ES": "Los widgets, que se asignan a un diálogo desde una base ajena, complementan los campos relacionales de un elemento predeterminado de la fuente de datos ajena con los datos del elemento activado. (La frase es una mierda de entender, pero hace exactamente lo que hace). En la aplicación de ejemplo, utilizo esto al asignar \"Contratos\" a una \"Persona\"."
    },
    "Es gibt aber auch Widgets, die mehrere Datensätze darstellen können, wie im Beispiel davor werden hier auch die Relationen verwendet, um nur Daten abzubilden, die etwas mit dem gewählten Item zu tun haben.": {
        "EN-US": "However, there are also widgets that can display several data records. As in the previous example, the relations are also used here to display only data that has something to do with the selected item.",
        "ES": "Sin embargo, también hay widgets que pueden mostrar varios registros de datos. Como en el ejemplo anterior, aquí también se utilizan las relaciones para mostrar sólo los datos que tienen algo que ver con el elemento seleccionado."
    },
    "Die ID des übergeordneten Elements. Nur zu setzen, wenn das Widget in einem Dialog einer anderen Basis gerendert werden soll.": {
        "EN-US": "The ID of the parent element. Only to be set if the widget is to be rendered in a dialog of another Base.",
        "ES": "El ID del elemento padre. Sólo debe establecerse si el widget se va a renderizar en un diálogo de otra base."
    },
    "Das Symbol des Widgets.": {
        "EN-US": "The icon of the widget.",
        "ES": "El icono del widget."
    },
    "Der Titel des Widgets.": {
        "EN-US": "The title of the widget.",
        "ES": "El título del widget."
    },
    "Die Beschreibung des Widgets.": {
        "EN-US": "The description of the widget.",
        "ES": "La descripción del widget."
    },
    "Gibt an wie das Widget die Daten darstellen wird. Standardwert ist ``default``.": {
        "EN-US": "Specifies how the widget will display the data. The default value is ``default``.",
        "ES": "Especifica cómo mostrará los datos el widget. El valor por defecto es ``default``."
    },
    "Die Felder, die in dem Widget angezeigt werden.": {
        "EN-US": "The fields that are displayed in the widget.",
        "ES": "Los campos que se muestran en el widget."
    },
    "Eine Funktion zur Registrierung einer Aktion. Sie wird als \"Decorator\" verwendet.": {
        "EN-US": "A function for registering an action. It is used as a \"Decorator\".",
        "ES": "Una función para registrar una acción. Se utiliza como \"Decorador\"."
    },
    "Eine Aktion ist die tatsächliche Interaktion zwischen dem Benutzer und dem Backend.": {
        "EN-US": "An action is the actual interaction between the user and the backend.",
        "ES": "Una acción es la interacción real entre el usuario y el backend."
    },
    "Die ID des übergeordneten Elements. Nur zu setzen, wenn die Aktion in einem Widget einer anderen Basis gerendert werden soll.": {
        "EN-US": "The ID of the parent element. Only to be set if the action is to be rendered in a widget of another Base.",
        "ES": "El ID del elemento padre. Solo debe establecerse si la acción se va a renderizar en un widget de otra base."
    },
    "Das Symbol der Aktion.": {
        "EN-US": "The symbol of action.",
        "ES": "El símbolo de la acción."
    },
    "Der Titel der Aktion.": {
        "EN-US": "The title of the campaign.",
        "ES": "El título de la campaña."
    },
    "Die Beschreibung der Aktion.": {
        "EN-US": "The description of the action.",
        "ES": "La descripción de la acción."
    },
    "Gibt an was die Aktion kann. Standardwert ist ``standard``.": {
        "EN-US": "Specifies what the action can do. The default value is ``standard``.",
        "ES": "Especifica lo que puede hacer la acción. El valor por defecto es ``standard``."
    },
    "Gib an, wie die Aktion ausgelöst wird.": {
        "EN-US": "Specify how the action is triggered.",
        "ES": "Especifique cómo se desencadena la acción."
    },
    "Gibt an, ob die Aktion Validierungsfehler zurückgeben kann. Standardwert ist ``True``. (Im Augenblick wirkt sich das nur auf den Typen ``submit`` aus.)": {
        "EN-US": "Specifies whether the action can return validation errors. The default value is ``True``. (At the moment, this only affects the ``submit`` type).",
        "ES": "Especifica si la acción puede devolver errores de validación. El valor por defecto es ``True``. (Por el momento, esto sólo afecta al tipo ``submit``)."
    },
    "Die Aktionen durchlaufen ein Modul, welches die erhaltenen Daten aufbereitet und als Keyword-Parameter an die dekorierte Funktion übergibt. Es ist alles in den ``kwargs`` zu finden und man macht sich diese einfach verfügbar. Der Parameter ``item`` ist ein Beispiel dafür und repräsentiert den vom Frontend zurückgegebenen Datensatz. Um herauszufinden, was alles noch in den ``kwargs`` steckt, bitte den Debugger benutzen.": {
        "EN-US": "The actions run through a module that processes the data received and passes it to the decorated function as a keyword parameter. Everything can be found in the ``kwargs`` and you simply make them available. The ``item`` parameter is an example of this and represents the data set returned by the frontend. To find out what else is in the ``kwargs``, please use the debugger.",
        "ES": "Las acciones se ejecutan a través de un módulo que prepara los datos recibidos y los pasa a la función decorada como parámetros de palabra clave. Todo se encuentra en los ``kwargs`` y simplemente hay que ponerlos a disposición. El parámetro ``item`` es un ejemplo de esto y representa el conjunto de datos devueltos por el frontend. Para saber qué más hay en los ``kwargs``, utiliza el depurador."
    },
    "Eine Funktion zur Registrierung einer Funktion in der übergeordneten Base. Sie wird als \"Decorator\" verwendet.": {
        "EN-US": "A function for registering a function in the parent base. It is used as a \"Decorator\".",
        "ES": "Una función para registrar una función en la base padre. Se utiliza como \"Decorador\"."
    },
    "Eine Funktion wird direkt nach der Zusammenstellung des Metadaten-Pool ausgeführt. Mit Funktionen kann man die Logik erweitern, Dinge vorbereiten oder Hintergrundaufgaben erledigen. Sie agieren als Instanzmethoden der Basis und erhalten damit den objektorientierten Ansatz.": {
        "EN-US": "A function is run directly after the metadata pool has been compiled. Functions can be used to extend the logic, prepare things or perform background tasks. They act as instance methods of the Base and thus maintain the object-oriented approach.",
        "ES": "Una función se ejecuta directamente después de compilar el conjunto de metadatos. Las funciones pueden utilizarse para ampliar la lógica, preparar cosas o realizar tareas en segundo plano. Actúan como métodos de instancia de la base y mantienen así el enfoque orientado a objetos."
    },
    "Gibt an wie eine Funktion ausgeführt wird. Mit dem Wert ``shot`` wird sie nur einmal ausgeführt. Der Wert ``work`` wird in einem Thread ausgeführt und kann somit Schleifen abarbeiten die niemals enden bis der Main-Thread endet.": {
        "EN-US": "Specifies how a function is run. With the value ``shot`` it is only run once. The value ``work`` is run in a thread and can therefore process loops that never end until the main thread ends.",
        "ES": "Especifica cómo se ejecuta una función. Con el valor ``shot`` sólo se ejecuta una vez. El valor ``work`` se ejecuta en un hilo y por lo tanto puede procesar bucles que nunca terminan hasta que el hilo principal termina."
    },
    "Felder": {
        "EN-US": "Fields",
        "ES": "Campos"
    },
    "The BackRefMetaField's name must match the name of the specified backref in the ForeignKey or ManyToMany field in the reference model.": {
        "EN-US": "The BackRefMetaField's name must match the name of the specified backref in the ForeignKey or ManyToMany field in the reference model.",
        "ES": "El nombre del BackRefMetaField debe coincidir con el nombre del backref especificado en el campo ForeignKey o ManyToMany del modelo de referencia."
    },
    "The BackRefMetaField is used by the user to represent relationships in the **decore Front** application. For example, it can be assigned to the filter or to a form. It is a MetaField and does not get a column in the database.": {
        "EN-US": "The BackRefMetaField is used by the user to represent relationships in the **decore Front** application. For example, it can be assigned to the filter or to a form. It is a MetaField and does not get a column in the database.",
        "ES": "El BackRefMetaField es utilizado por el usuario para representar relaciones en la aplicación **decore Front**. Por ejemplo, se puede asignar al filtro o a un formulario. Es un MetaField y no obtiene una columna en la base de datos."
    },
    "A human-readable name for the field.": {
        "EN-US": "A human-readable name for the field.",
        "ES": "Un nombre legible para el campo."
    },
    "Additional text to be displayed in **decore Front**.": {
        "EN-US": "Additional text to be displayed in **decore Front**.",
        "ES": "Texto adicional que debe aparecer en **decore Front**."
    },
    "A List of type string. Only the speciefied fields will be displayed in the filter. If None, all fields will be displayed.": {
        "EN-US": "A List of type string. Only the speciefied fields will be displayed in the filter. If None, all fields will be displayed.",
        "ES": "Una lista de tipo cadena. Sólo se mostrarán en el filtro los campos especificados. Si es Ninguno, se mostrarán todos los campos."
    },
    "A dictonary containing a query to be used when querying options (e.g. in selection fields in the frontend). The query always refers to the reference model.": {
        "EN-US": "A dictonary containing a query to be used when querying options (e.g. in selection fields in the frontend). The query always refers to the reference model.",
        "ES": "Un diccionario que contiene una consulta que se utilizará al consultar opciones (por ejemplo, en los campos de selección del frontend). La consulta siempre hace referencia al modelo de referencia."
    },
    "A field to store boolean values.": {
        "EN-US": "A field to store boolean values.",
        "ES": "Un campo para almacenar valores booleanos."
    },
    "If True, the field is allowed to be null. Defaults to False.": {
        "EN-US": "If True, the field is allowed to be null. Defaults to False.",
        "ES": "Si es True, se permite que el campo sea nulo. Por defecto es False."
    },
    "The default value for the field. Defaults to None.": {
        "EN-US": "The default value for the field. Defaults to None.",
        "ES": "Valor por defecto del campo. Por defecto es Ninguno."
    },
    "A field to store char values.": {
        "EN-US": "A field to store char values.",
        "ES": "Un campo para almacenar valores char."
    },
    "If True, the field must be unique in database table. Defaults to False.": {
        "EN-US": "If True, the field must be unique in database table. Defaults to False.",
        "ES": "Si es True, el campo debe ser único en la tabla de la base de datos. Por defecto es False."
    },
    "A field to store date values.": {
        "EN-US": "A field to store date values.",
        "ES": "Un campo para almacenar valores de fecha."
    },
    "A field to store datetime values.": {
        "EN-US": "A field to store datetime values.",
        "ES": "Un campo para almacenar valores de fecha y hora."
    },
    "A field to store float values.": {
        "EN-US": "A field to store float values.",
        "ES": "Un campo para almacenar valores flotantes."
    },
    "A field to represent a one-to-many relationship between two models.": {
        "EN-US": "A field to represent a one-to-many relationship between two models.",
        "ES": "Campo que representa una relación uno a muchos entre dos modelos."
    },
    "The model to which the relationship is to be established.": {
        "EN-US": "The model to which the relationship is to be established.",
        "ES": "El modelo con el que se establecerá la relación."
    },
    "The name of the field in the reference model that represents the relationship to the model.": {
        "EN-US": "The name of the field in the reference model that represents the relationship to the model.",
        "ES": "Nombre del campo del modelo de referencia que representa la relación con el modelo."
    },
    "A dictonary containing a query to be used when querying choices (e.g. in selection fields in the frontend). The query always refers to the reference model.": {
        "EN-US": "A dictonary containing a query to be used when querying choices (e.g. in selection fields in the frontend). The query always refers to the reference model.",
        "ES": "Un diccionario que contiene una consulta que se utilizará al consultar las opciones (por ejemplo, en los campos de selección del frontend). La consulta siempre hace referencia al modelo de referencia."
    },
    "A field to store integer values.": {
        "EN-US": "A field to store integer values.",
        "ES": "Un campo para almacenar valores enteros."
    },
    "A field to represent a many-to-many relationship between two models. It is a MetaField and does not get a column in the database. However, a through model is created by decore Base, which represents the relationship between the two models.": {
        "EN-US": "A field to represent a many-to-many relationship between two models. It is a MetaField and does not get a column in the database. However, a through model is created by decore Base, which represents the relationship between the two models.",
        "ES": "Un campo para representar una relación muchos-a-muchos entre dos modelos. Es un MetaField y no obtiene una columna en la base de datos. Sin embargo, se crea un modelo a través de decore Base, que representa la relación entre los dos modelos."
    },
    "The keybase is a KeePass file and should be protected by setting the correct access rights (ACL).": {
        "EN-US": "The keybase is a KeePass file and should be protected by setting the correct access rights (ACL).",
        "ES": "La base de claves es un archivo KeePass y debe protegerse estableciendo los derechos de acceso correctos (ACL)."
    },
    "A field to store passwords in the keybase and to use them again.": {
        "EN-US": "A field to store passwords in the keybase and to use them again.",
        "ES": "Un campo para almacenar contraseñas en la base de claves y volver a utilizarlas."
    },
    "A field to store text values.": {
        "EN-US": "A field to store text values.",
        "ES": "Un campo para almacenar valores de texto."
    },
    "create dashbord with python fastly": {
        "EN-US": "create dashbord with python fastly",
        "ES": "crear dashbord con python fastly"
    },
    "python gui, decore, python database, python dashboard, python orm, python ui, dashboard creation, python application, ui framework, ui toolkit": {
        "EN-US": "python gui, decore, python database, python dashboard, python orm, python ui, dashboard creation, python application, ui framework, ui toolkit",
        "ES": "python gui, decore, python database, python dashboard, python orm, python ui, creación dashboard, python application, ui framework, ui toolkit"
    },
    "Erste Schritte": {
        "EN-US": "Get started",
        "ES": "Primeros pasos"
    },
    "Um die schnelle GUI-Dashboard-Erstellung, mit decore Base in Python, zu veranschaulichen werden wir nun gemeinsam eine kleine UI in Form einer Webanwendung erstellen.": {
        "EN-US": "To illustrate the fast GUI dashboard build with decore Base in Python, we will now create a small UI in the form of a web application together.",
        "ES": "Para ilustrar la rápida creación de cuadros de mando GUI con decore Base en Python, vamos a crear juntos una pequeña UI en forma de aplicación web."
    },
    "Die dekorierten Funktionen dienen, in allererster Linie, der Erstellung von Metainformationen für die spätere Auswertung im Frontend der Anwendung und sind nichts, wovor man sich fürchten muss.": {
        "EN-US": "The decorated functions are used, first and foremost, to build meta information for later evaluation in the front end of the application and are nothing to be afraid of.",
        "ES": "Las funciones decoradas se utilizan principalmente para crear metainformación para su posterior evaluación en el front-end de la aplicación y no son nada que temer."
    },
    "*Es ist wirklich einfach, bitte folgen Sie mir!*": {
        "EN-US": "*It's really simple, please follow me!",
        "ES": "*Es muy sencillo, ¡por favor sígueme!"
    },
    "Installation": {
        "EN-US": "Installation",
        "ES": "Instalación"
    },
    "Erstellen Sie zunächst ein leeres Python-Projekt in Ihrem gewünschten Verzeichnis.": {
        "EN-US": "First build an empty Python project in your desired directory.",
        "ES": "Primero crea un proyecto Python vacío en el directorio que desees."
    },
    "Um decore Base zu installieren, führen wir den folgenden Befehl im Stammverzeichnis des Projekts aus. Verwenden wir das Terminal in vscode.": {
        "EN-US": "To install decore Base, we run the following command in the root directory of the project. Let's use the terminal in vscode.",
        "ES": "Para instalar decore Base, ejecutamos el siguiente comando en el directorio raíz del proyecto. Vamos a utilizar el terminal en vscode."
    },
    "Dies erfordert eine aktivierte Python-Umgebung! Um mehr darüber zu erfahren, besuchen Sie `Python-Umgebungen in VS Code <https://code.visualstudio.com/docs/python/environments>`_.": {
        "EN-US": "This requires an activated Python environment! To learn more about this, visit `Python environments in VS Code <https://code.visualstudio.com/docs/python/environments>`_.",
        "ES": "Esto requiere un entorno Python activado. Para saber más sobre esto, visita `Entornos Python en VS Code <https://code.visualstudio.com/docs/python/environments>`_."
    },
    "Vorbereitung": {
        "EN-US": "Preparation",
        "ES": "Preparación"
    },
    "Um für unsere zukünftige Python GUI-Dashboard-Anwendung alles nötige an Pfaden und Einstellungen zu erhalten, müssen wir noch die Vorbereitung durchführen.": {
        "EN-US": "To get all the necessary paths and settings for our future Python GUI dashboard application, we still need to do the preparation.",
        "ES": "Con el fin de obtener todas las rutas y configuraciones necesarias para nuestra futura aplicación Python GUI dashboard, todavía tenemos que llevar a cabo la preparación."
    },
    "Erstellen wir nun eine neue Datei mit dem Namen **app.py** im Hauptverzeichnis des Projekts.": {
        "EN-US": "Build a new file with the name **app.py** in the root directory of the project.",
        "ES": "Creemos ahora un nuevo archivo con el nombre **app.py** en el directorio principal del proyecto."
    },
    "Um decore zu verwenden, importieren wir es zunächst in das Modul **app.py**.": {
        "EN-US": "To use decore, we first import it into the **app.py** module.",
        "ES": "Para utilizar decore, primero lo importamos en el módulo **app.py**."
    },
    "Dann verwenden wir den Befehl ``prepare``, um alle erforderlichen Hilfsdateien im Stammverzeichnis des Projekts zu erstellen.": {
        "EN-US": "Then we use the ``prepare`` command to create all the necessary auxiliary files in the root directory of the project.",
        "ES": "A continuación, utilizamos el comando ``prepare`` para crear todos los archivos auxiliares necesarios en el directorio raíz del proyecto."
    },
    "Um nun die Anwendung tatsächlich vorzubereiten, führen wir den Befehl ``python app.py --prepare`` im Terminal aus. Der Pfad muss im Hauptverzeichnis des Projekts liegen, also dort wo sich die **app.py** befindet.": {
        "EN-US": "To actually prepare the application, we execute the command ``python app.py --prepare`` in the terminal. The path must be in the root directory of the project, i.e. where the **app.py** is located.",
        "ES": "Para preparar realmente la aplicación, ejecutamos el comando ``python app.py --prepare`` en el terminal. La ruta debe estar en el directorio raíz del proyecto, es decir, donde se encuentra el **app.py**."
    },
    "Verwendung": {
        "EN-US": "Use",
        "ES": "Utilización"
    },
    "Damit der Python-Interpreter die zukünftigen Basisklassen verarbeiten kann, fügen wir den folgenden Import hinzu.": {
        "EN-US": "To enable the Python interpreter to process the future base classes, we add the following import.",
        "ES": "Para que el intérprete de Python pueda procesar las futuras clases base, añadimos el siguiente import."
    },
    "Normalerweise enthält ein Python-Hauptmodul eine Abfrage, die prüft, ob es das Hauptmodul ist, so dass wir anschließend die Funktion ``main`` aufrufen können.": {
        "EN-US": "Normally, a Python main module contains a query that checks whether it is the main module so that we can then call the ``main`` function.",
        "ES": "Normalmente, un módulo principal de Python contiene una consulta que comprueba si es el módulo principal para que luego podamos llamar a la función ``main``."
    },
    "Als nächstes erstellen wir eine Zeile ``if __name__ == '__main__':`` in der **app.py** Datei.": {
        "EN-US": "Next, we build a line ``if __name__ == '__main__':`` in the **app.py** file.",
        "ES": "A continuación, creamos una línea ``if __name__ == '__main__':`` en el archivo **app.py**."
    },
    "Um eine neue \"decore\" Anwendungsinstanz zu erstellen, benutzen wir eine mit ``@decore.app`` dekorierte ``main()`` Funktion in der **app.py** Datei, direkt unter der Zeile: ``if __name__ == '__main__':``.": {
        "EN-US": "To build a new \"decore\" application instance, we use a ``main()`` function decorated with ``@decore.app`` in the **app.py** file, just below the line: ``if __name__ == '__main__':``.",
        "ES": "Para crear una nueva instancia de aplicación \"decore\", utilizamos una función ``main()`` decorada con ``@decore.app`` en el archivo **app.py**, justo debajo de la línea: ``if __name__ == '__main__':``."
    },
    "Model": {
        "EN-US": "Model",
        "ES": "Modelo"
    },
    "In einem Modell legen wir die Datenfelder fest, die später einer Basis zugeordnet werden muss. Es dient als Datenbankschnittstelle zu den Datenbanktreibern wie SQLite, MySQL, PostgreSQL, etc.": {
        "EN-US": "In a Model, we define the data fields that must later be assigned to a Base. It serves as a database interface to the database drivers such as SQLite, MySQL, PostgreSQL, etc.",
        "ES": "En un modelo se definen los campos de datos que posteriormente deben asignarse a una base. Sirve de interfaz de base de datos para los controladores de bases de datos como SQLite, MySQL, PostgreSQL, etc."
    },
    "Wir erstellen nun die Datei first_model.py im Verzeichnis **models** und fügen den folgenden Code ein:": {
        "EN-US": "We now build the file first_model.py in the **models** directory and add the following code:",
        "ES": "Ahora creamos el archivo first_model.py en el directorio **models** e insertamos el siguiente código:"
    },
    "Es muss nicht für jede Basis ein Modell angelegt werden aber es muss jedes zu verwenden Modell eine Basis haben, die über die Datei **__init__.py**, importiert werden muss. Nur so werden Rellationen zwischen den Modellen auch im Frontend ausgewertet und dargestellt.": {
        "EN-US": "It is not necessary to create a Model for each Base, but each Model to be used must have a Base, which must be imported via the file **__init__.py**. This is the only way to evaluate and display rellations between the models in the frontend.",
        "ES": "No es necesario crear un modelo para cada base, pero cada modelo a utilizar debe tener una base, que debe ser importada a través del fichero **__init__.py**. Esta es la única manera de evaluar y mostrar las rellaciones entre los modelos en el frontend."
    },
    "Um mögliche zirkuläre Importe zu vermeiden, legen wir die Modellklassen in einem eigenen Verzeichnis **models** in unserem Projektstammverzeichnis an. Das Verzeichnis **models** wurde durch den zuvor ausgeführten Befehl ``python app.py --prepare`` erstellt.": {
        "EN-US": "To avoid possible circular imports, we create the model classes in a separate **models** directory in our project root directory. The **models** directory was built using the ``python app.py --prepare`` command executed previously.",
        "ES": "Para evitar posibles importaciones circulares, creamos las clases modelo en un directorio **models** separado en el directorio raíz de nuestro proyecto. El directorio **models** fue creado por el comando ``python app.py --prepare`` ejecutado previamente."
    },
    "In dem hier gezeigten Beispiel importieren wir aus der **uniform library** die Klasse Conform_model und erweitern sie um die Felder Vorname und Nachname.": {
        "EN-US": "In the example shown here, we import the Conform_model class from the **uniform library** and extend it with the first name and last name fields.",
        "ES": "En el ejemplo que se muestra aquí, importamos la clase Conform_model de la **biblioteca uniforme** y la ampliamos con los campos nombre y apellidos."
    },
    "Die Modelle in **decore Base** basieren auf dem großartigen Peewee ORM. Um mehr über Peewee zu erfahren, besuchen Sie `Peewee ORM <http://docs.peewee-orm.com/en/latest/>`_.": {
        "EN-US": "The models in **decore Base** are based on the great Peewee ORM. To learn more about Peewee, visit `Peewee ORM <http://docs.peewee-orm.com/en/latest/>`_.",
        "ES": "Los modelos de **decore Base** se basan en el gran Peewee ORM. Para saber más sobre Peewee, visita `Peewee ORM <http://docs.peewee-orm.com/en/latest/>`_."
    },
    "Beim Importieren ist zu beachten, dass wir alles (*) aus dem conform_model Namespace importieren, um auch die Feldklassen zu erhalten.": {
        "EN-US": "When importing, please note that we import everything (*) from the conform_model namespace in order to obtain the field classes as well.",
        "ES": "Al importar, tenga en cuenta que importamos todo (*) del espacio de nombres conform_model para obtener también las clases de campo."
    },
    "Die Basisklassen dienen der decore-Anwendung als Trägerelement für die View-Komponenten, pflegen das Datenmodell ein und gelten damit auch als Datenquelle für die Auswertung im Frontend des Dashboards.": {
        "EN-US": "The base classes serve the decore application as a carrier element for the view components, maintain the data model and are therefore also the data source for the evaluation in the front end of the dashboard.",
        "ES": "Las clases base sirven a la aplicación decore como elemento portador de los componentes de la vista, mantienen el modelo de datos y, por tanto, son también la fuente de datos para el análisis en el front-end del cuadro de mando."
    },
    "Nun müssen wir ein neues Python-Modul erstellen, das z.B. eine Basisklasse enthält: **first_base.py**, im Verzeichnis **bases** in unserem Projektstammverzeichnis. Das Verzeichnis **bases** wurde durch den zuvor ausgeführten Befehl ``python app.py --prepare`` miterzeugt.": {
        "EN-US": "Now we need to create a new Python module containing a base class, for example: **first_base.py**, in the **bases** directory in our project root directory. The **bases** directory was created by the ``python app.py --prepare`` command executed previously.",
        "ES": "Ahora necesitamos crear un nuevo módulo Python que contenga una clase base, por ejemplo: **primera_base.py**, en el directorio **bases** del directorio raíz de nuestro proyecto. El directorio **bases** fue creado por el comando ``python app.py --prepare`` ejecutado previamente."
    },
    "Um das zuvor erstellte Modell zu verwenden, importieren wir es in die Base-Klasse und übergeben es an den Parameter ``model``.": {
        "EN-US": "To use the previously built Model, we import it into the Base class and pass it to the ``model`` parameter.",
        "ES": "Para utilizar el modelo creado previamente, lo importamos a la clase Base y lo pasamos al parámetro ``model``."
    },
    "In order for the Python interpreter to be able to process the base classes, we have to import them into the __init__.py file in the **bases** directory. The order of the individual imports also determines the order in **decore Front**.": {
        "EN-US": "In order for the Python interpreter to be able to process the base classes, we have to import them into the __init__.py file in the **bases** directory. The order of the individual imports also determines the order in **decore Front**.",
        "ES": "Para que el intérprete de Python pueda procesar las clases base, tenemos que importarlas en el archivo __init__.py en el directorio **bases**. El orden de las importaciones individuales también determina el orden en **decore Front**."
    },
    "We edit the **__init__.py** file and insert the following code:": {
        "EN-US": "We edit the **__init__.py** file and insert the following code:",
        "ES": "Editamos el fichero **__init__.py** e insertamos el siguiente código:"
    },
    "Views werden von der decore-Anwendung verwendet, um die Datensätze im Frontend der Webanwendung zu präsentieren.": {
        "EN-US": "Views are used by the decore application to present the data records in the front end of the web application.",
        "ES": "Las vistas son utilizadas por la aplicación decore para presentar los registros de datos en el front-end de la aplicación web."
    },
    "Mit dem View-Decorator können wir nun eine Ansichts-Komponente erstellen und sie, unter der zuvor erstellten Basisklasse, einhängen.": {
        "EN-US": "With the View decorator, we can now create a View component and mount it under the previously created base class.",
        "ES": "Con el decorador de vista, ahora podemos crear un componente de vista y adjuntarlo bajo la clase base creada anteriormente."
    },
    "Wir bearbeiten nun die Datei **first_base.py** erneut und erweitern den Code wie folgt:": {
        "EN-US": "We now edit the **first_base.py** file again and extend the code as follows:",
        "ES": "Ahora editamos de nuevo el archivo **first_base.py** y ampliamos el código de la siguiente manera:"
    },
    "Dialoge sind die unterstützenden Elemente für Widgets im Frontend der Webanwendung. Sie können Ansichten aber auch untergeordneten Widgets hinzugefügt werden und steuern die Sichtbarkeit und den Anzeigestil von Kindelementen. Dialoge erhalten auch die Kontrolle über die Sendefunktionen der Widgets.": {
        "EN-US": "Dialogs are the supporting elements for widgets in the front end of the web application. They can be added to views but also to subordinate widgets and control the visibility and display style of child elements. Dialogs are also given control over the sending functions of the widgets.",
        "ES": "Los diálogos son los elementos de soporte para los widgets en el front-end de la aplicación web. Pueden añadirse tanto a las vistas como a los widgets subordinados y controlan la visibilidad y el estilo de visualización de los elementos hijos. Los diálogos también tienen control sobre las funciones de envío de los widgets."
    },
    "In unserem Fall erstellen wir einen Dialog, um eine neue Person mit Vornamen und Nachnamen anzulegen.": {
        "EN-US": "In our case, we build a dialog to create a new person with first name and last name.",
        "ES": "En nuestro caso, creamos un diálogo para crear una nueva persona con nombre y apellidos."
    },
    "Hier gehen wir ... wieder die Datei **first_base.py** und erweitern den Code wie folgt:": {
        "EN-US": "Here we go ... the file **first_base.py** again and extend the code as follows:",
        "ES": "Aquí vamos ... el archivo **first_base.py** de nuevo y ampliar el código de la siguiente manera:"
    },
    "Widgets sind Komponenten, mit denen wir Interaktionen mit dem einzelnen Datensatz durchführen können. Sie können nur zu Dialogen hinzugefügt werden und sind stapelbar.": {
        "EN-US": "Widgets are components with which we can perform interactions with the individual data set. They can only be added to dialogs and are stackable.",
        "ES": "Los widgets son componentes con los que podemos interactuar con el conjunto de datos individuales. Sólo se pueden añadir a los diálogos y son apilables."
    },
    "Was wir jetzt brauchen, ist ein Eingabeformular, um die Daten für die neue Person einzugeben.": {
        "EN-US": "What we need now is an input form to enter the data for the new person.",
        "ES": "Lo que necesitamos ahora es un formulario de entrada para introducir los datos de la nueva persona."
    },
    "Actions sind Methoden, mit das Frontend mit **decore Base** kommunizieren kann. Sie können zu View und Widgets hinzugefügt werden und sind die einzigen echten Klassenmethoden und werden direkt in der Basis aufgerufen.": {
        "EN-US": "Actions are methods with which the frontend can communicate with **decore Base**. They can be added to views and widgets and are the only real class methods and are called directly in the Base.",
        "ES": "Las acciones son métodos con los que el frontend puede comunicarse con **decore Base**. Se pueden añadir a las vistas y widgets y son los únicos métodos reales de la clase y se llaman directamente en la base."
    },
    "Wir brauchen nun eine Aktion, um die Daten der neuen Person zu speichern und erweitern den Code in **first_base.py** wie folgt:": {
        "EN-US": "We now need an action to save the new person's data and extend the code in **first_base.py** as follows:",
        "ES": "Ahora necesitamos una acción para guardar los datos de la nueva persona y ampliar el código en **first_base.py** de la siguiente manera:"
    },
    "Um einen Datensatz mit decore Base zu erstellen, müssen wir eine Instanz des Modells erstellen. In unserem Fall **First_model**. Die Instanz wird mit den Daten aus dem Formular gefüllt und dann gespeichert.": {
        "EN-US": "To build a dataset with decore Base, we need to create an instance of the Model. In our case **First_model**. The instance is filled with the data from the form and then saved.",
        "ES": "Para crear un conjunto de datos con decore Base, necesitamos crear una instancia del modelo. En nuestro caso **Primer_modelo**. La instancia se rellena con los datos del formulario y luego se guarda."
    },
    "Die ID, in Form einer UUID im Textformat, wird automatisch generiert und muss nicht gesondert angegeben werden.": {
        "EN-US": "The ID, in the form of a UUID in text format, is generated automatically and does not need to be specified separately.",
        "ES": "El ID, en forma de UUID en formato de texto, se genera automáticamente y no es necesario especificarlo por separado."
    },
    "Das Feld **titel** muss bei jeder Datensatzerstellung verwendet werden. Andernfalls wird das Element die Validierung nicht bestehen. Es sollte ausserdem immer eindeutig sein, also keine gleichen Titel in der Datenbank geben.": {
        "EN-US": "The **title** field must be used each time a data record is created. Otherwise the element will not pass validation. It should also always be unique, i.e. there should be no identical titles in the database.",
        "ES": "El campo **título** debe utilizarse cada vez que se cree un registro de datos. De lo contrario, el elemento no pasará la validación. También debe ser siempre único, es decir, no debe haber títulos idénticos en la base de datos."
    },
    "Ausführung, Entwicklung und Erstellung": {
        "EN-US": "Run, development and build",
        "ES": "Ejecución, desarrollo y creación"
    },
    "Ausführung": {
        "EN-US": "Run",
        "ES": "Ejecución"
    },
    "Um Ihre Anwendung zu starten, führen Sie ``python app.py`` in Ihrem Projekt-Stammverzeichnis aus. Verwenden Sie das Terminal in vscode.": {
        "EN-US": "To start your application, run ``python app.py`` in your project root directory. Use the terminal in vscode.",
        "ES": "Para iniciar su aplicación, ejecute ``python app.py`` en el directorio raíz de su proyecto. Utilice el terminal en vscode."
    },
    "Öffnen Sie den Browser und geben Sie ``http://localhost:5555`` ein.": {
        "EN-US": "Open the browser and enter ``http://localhost:5555``.",
        "ES": "Abra el navegador e introduzca ``http://localhost:5555``."
    },
    "Entwicklung": {
        "EN-US": "Development",
        "ES": "Desarrollo"
    },
    "Um Ihre Anwendung zu entwickeln, verwenden Sie Ihren Debugger mit dem Profil ``[dev] decore base development`` in vscode.": {
        "EN-US": "To develop your application, use your debugger with the profile ``[dev] decore base development`` in vscode.",
        "ES": "Para desarrollar su aplicación, utilice su depurador con el perfil ``[dev] decore base development`` en vscode."
    },
    "Erstellung": {
        "EN-US": "Build",
        "ES": "Creación"
    },
    "Um Ihre Anwendung zu erstellen, führen Sie ``python app.py --build`` in Ihrem Projekt-Stammverzeichnis aus. Verwenden Sie das Terminal in vscode.": {
        "EN-US": "To build your application, run ``python app.py --build`` in your project root directory. Use the terminal in vscode.",
        "ES": "Para construir su aplicación, ejecute ``python app.py --build`` en el directorio raíz de su proyecto. Utilice el terminal en vscode."
    },
    "Typen": {
        "EN-US": "Types",
        "ES": "Tipos"
    },
    "Ansicht": {
        "EN-US": "View",
        "ES": "Ver"
    },
    "Tabelle": {
        "EN-US": "Table",
        "ES": "Cuadro"
    },
    "Der Ansichtstyp Tabelle dient der tabellarischen Darstellung von Daten.": {
        "EN-US": "The Table view type is used to display data in tabular form.",
        "ES": "El tipo de vista Tabla se utiliza para mostrar datos en forma de tabla."
    },
    "Features": {
        "EN-US": "Features",
        "ES": "Características"
    },
    "Decore ist eine Biblitothek zur Erstellung von Gui-Dashboard-Anwendungen in Python die ein vielzahl an Eigenschaften hervorbringt und auch in zukunft stetig erweitert wird.": {
        "EN-US": "Decore is a library for building gui dashboard applications in Python that provides a variety of features and will be continuously expanded in the future.",
        "ES": "Decore es una librería para la creación de aplicaciones Gui dashboard en Python que proporciona una gran variedad de funcionalidades y que será ampliada continuamente en el futuro."
    },
    "Durch die Verbindung einiger wirklich guter Python-Pakete war die Arbeit an decore überhaupt erst möglich. Daher möchte ich mich an dieser Stelle bei den Entwicklern der folgenden Pakete bedanken:": {
        "EN-US": "Working on decore was only possible thanks to the combination of some really good Python packages. I would therefore like to take this opportunity to thank the developers of the following packages:",
        "ES": "Trabajar en decore sólo ha sido posible gracias a la combinación de algunos paquetes de Python realmente buenos. Por ello, me gustaría aprovechar esta oportunidad para dar las gracias a los desarrolladores de los siguientes paquetes:"
    },
    "**Peewee** - Ein einfaches, aber leistungsstarkes ORM, das eine flexible Datenbankanbindung für Python bietet. http://docs.peewee-orm.com/en/latest/index.html": {
        "EN-US": "**Peewee** - A simple but powerful ORM that provides a flexible database connection for Python. http://docs.peewee-orm.com/en/latest/index.html",
        "ES": "**Peewee** - Un ORM sencillo pero potente que proporciona una conexión flexible a bases de datos para Python. http://docs.peewee-orm.com/en/latest/index.html"
    },
    "**Flask** - Ein Microframework für Python basierend auf Werkzeug, Jinja 2 und guter Absichten. http://flask.pocoo.org/": {
        "EN-US": "**Flask** - A microframework for Python based on Werkzeug, Jinja 2 and good intentions. http://flask.pocoo.org/",
        "ES": "**Flask** - Un microframework para Python basado en Werkzeug, Jinja 2 y buenas intenciones. http://flask.pocoo.org/"
    },
    "**Quasar** - Ein Vue.js basiertes Frontend-Framework. https://quasar-framework.org/": {
        "EN-US": "**Quasar** - A Vue.js based frontend framework. https://quasar-framework.org/",
        "ES": "**Quasar** - Un marco frontend basado en Vue.js. https://quasar-framework.org/"
    },
    "**Vue.js** - Ein progressiver, inkrementeller JavaScript-Framework für die Entwicklung von Benutzeroberflächen. https://vuejs.org/": {
        "EN-US": "**Vue.js** - A progressive, incremental JavaScript framework for user interface development. https://vuejs.org/",
        "ES": "**Vue.js** - Un marco JavaScript progresivo e incremental para el desarrollo de interfaces de usuario. https://vuejs.org/"
    },
    "**Cerberus** - Eine Validierungs-Bibliothek für Python-Datenstrukturen. http://docs.python-cerberus.org/en/stable/": {
        "EN-US": "**Cerberus** - A validation library for Python data structures. http://docs.python-cerberus.org/en/stable/",
        "ES": "**Cerberus** - Biblioteca de validación de estructuras de datos en Python. http://docs.python-cerberus.org/en/stable/"
    },
    "**pykeepass** - Eine Bibliothek zum interagieren von KeePass 1.x und 2.x Datenbanken. http://pykeepass.readthedocs.io/en/latest/": {
        "EN-US": "**pykeepass** - A library for interacting with KeePass 1.x and 2.x databases. http://pykeepass.readthedocs.io/en/latest/",
        "ES": "**pykeepass** - Una biblioteca para interactuar con las bases de datos KeePass 1.x y 2.x. http://pykeepass.readthedocs.io/en/latest/"
    },
    "Die nun folgenden Feature- und Änderungs-Aufzählungen sind in decore Base enthalten.": {
        "EN-US": "The following feature and change lists are contained in decore Base.",
        "ES": "Las siguientes listas de características y cambios se encuentran en decore Base."
    },
    "Management & Backend-Anwendung": {
        "EN-US": "Management & backend application",
        "ES": "Gestión y aplicación backend"
    },
    "schnelle und einfache GUI-Dashboard-Anwendungs Entwicklung mittels Python Decorators.": {
        "EN-US": "Fast and easy GUI dashboard application development using Python Decorators.",
        "ES": "Desarrollo rápido y sencillo de aplicaciones GUI para cuadros de mando utilizando decoradores de Python."
    },
    "Erhaltung des Objekt-Orientierten Programmierstils in den Basisklassen, durch Aktionsufruf als Instanzmethoden.": {
        "EN-US": "Preservation of the object-oriented programming style in the base classes, by calling actions as instance methods.",
        "ES": "Preservación del estilo de programación orientado a objetos en las clases base, llamando a las acciones como métodos de instancia."
    },
    "Speichung von wiederverwendbaren Kennwörtern (**keine Benutzerkennwörter**) in einer KeePass-Datenbank (**Hier wird noch ein Sicherheitsleitfaden erstellt**).": {
        "EN-US": "Storage of reusable passwords (**not user passwords**) in a KeePass database (**A security guide is still being built here**).",
        "ES": "Almacenamiento de contraseñas reutilizables (**no contraseñas de usuario**) en una base de datos KeePass (**aquí aún se está creando una guía de seguridad**)."
    },
    "Fortschrittsmitteilung an das Frontend durch das Actor-Modul.": {
        "EN-US": "Progress notification to the front end by the actor module.",
        "ES": "Notificación de progreso al front end por parte del módulo actor."
    },
    "ORM Erweiterung & Datenbankanbindung": {
        "EN-US": "ORM extension & database connection",
        "ES": "Extensión ORM y conexión a bases de datos"
    },
    "Einfache Datensatzereugung mit angepasster aber vereinfachter Peewee-Integration.": {
        "EN-US": "Simple data record creation with customized but simplified Peewee integration.",
        "ES": "Creación sencilla de registros de datos con integración personalizada pero simplificada de Peewee."
    },
    "Derzeit Mögliche Datenbank-Schnittstellen: SQLite ... (**Hier kommt schon bald mehr** ).": {
        "EN-US": "Currently possible database interfaces: SQLite ... (**more to come soon** ).",
        "ES": "Interfaces de base de datos posibles actualmente: SQLite ... (**más en breve** )."
    },
    "Relationale Datenbank-Abfragen mit einer eigenen ``query`` Methode in im decore Model.": {
        "EN-US": "Relational database queries with a separate ``query`` method in the decore model.",
        "ES": "Consultas a bases de datos relacionales con un método ``query`` independiente en el modelo decore."
    },
    "Semi-Automatische Datensatzerstellung bei Aktionsverwendung durch das Actor-Modul.": {
        "EN-US": "Semi-automatic data record creation when actions are used by the Actor module.",
        "ES": "Creación semiautomática de registros de datos cuando el módulo Actor utiliza acciones."
    },
    "Intergrierte Feldattribut definierte Standard-Validierung beim speichern eines Datensatzes.": {
        "EN-US": "Integrated field attribute defined standard validation when saving a data record.",
        "ES": "Validación estándar definida por atributo de campo integrada al guardar un registro de datos."
    },
    "Webanwendung (SPA)": {
        "EN-US": "Web application (SPA)",
        "ES": "Aplicación web (SPA)"
    },
    "Automatische und generische Erzeugung der GUI-Dashboard-Komponenten anhand der erfassten Metadaten.": {
        "EN-US": "Automatic and generic generation of GUI dashboard components based on the captured metadata.",
        "ES": "Generación automática y genérica de los componentes del cuadro de mandos de la interfaz gráfica de usuario a partir de los metadatos recopilados."
    },
    "Vorgefertigtes Layout, reagierende Navigationsleiste und Basisbreich für die Ansicht-Komponenten.": {
        "EN-US": "Predefined layout, responsive navigation bar and basic area for View components.",
        "ES": "Diseño prefabricado, barra de navegación responsiva y área básica para los componentes de la vista."
    },
    "Dialogsteuerung durch URL-Navigation": {
        "EN-US": "Dialog control through URL navigation",
        "ES": "Control del diálogo mediante navegación por URL"
    },
    "Erzeugung eines relationalen Datensatzes für die weiterverwenung im Widget.": {
        "EN-US": "Creation of a relational data set for further use in the widget.",
        "ES": "Creación de un conjunto de datos relacionales para su uso posterior en el widget."
    },
    "Sample": {
        "EN-US": "Sample",
        "ES": "Muestra"
    },
    "decore Base | UI fastly": {
        "EN-US": "decore Base | UI fastly",
        "ES": "decore Base | UI fastly"
    },
    "index, follow": {
        "EN-US": "index, follow",
        "ES": "índice, siga"
    },
    "Einleitung": {
        "EN-US": "Introduction",
        "ES": "Introducción"
    },
    "decore Base ist ein out-of-the-box \"Python to Vue.js\" Datenanwendungs-Dashboard, das Ihnen hilft, in wenigen einfachen Schritten von der Idee zur Ansicht zu gelangen. Es richtet sich an diejenigen, die sich auf die Ergebnisse ihrer Algorithmen konzentrieren wollen, wissenschaftliche Arbeit leisten oder Lehr- und Lernfunktionen ausführen wollen.": {
        "EN-US": "decore Base is an out-of-the-box \"Python to Vue.js\" data application dashboard that helps you go from Idea to View in a few simple steps. It is aimed at those who want to focus on the results of their algorithms, do scientific work or perform teaching and learning functions.",
        "ES": "decore Base es un panel de aplicaciones de datos \"Python to Vue.js\" listo para usar que te ayuda a pasar de la idea a la vista en unos sencillos pasos. Está dirigido a quienes desean centrarse en los resultados de sus algoritmos, realizar trabajos científicos o desempeñar funciones de enseñanza y aprendizaje."
    },
    "**decore Base ist derzeit in Arbeit, nur lokal bereitstellbar, nur für Windows verfügbar und noch nicht produktionsbereit**.": {
        "EN-US": "**decore Base is currently a work in progress, only available locally, only available for Windows and not yet ready for production**.",
        "ES": "**decore Base es actualmente un trabajo en curso, sólo disponible a nivel local, sólo disponible para Windows y aún no está listo para la producción**."
    },
    "Die empfohlene IDE ist Visual Studio Code und alle Kommentare, Beschreibungen und Dokumentationen beziehen sich vorerst auch nur auf vscode.": {
        "EN-US": "The recommended IDE is Visual Studio Code and all comments, descriptions and documentation refer to vscode only for the time being.",
        "ES": "El IDE recomendado es Visual Studio Code y todos los comentarios, descripciones y documentación se refieren sólo a vscode por el momento."
    },
    "Entwicklungsphasen & Vorteile": {
        "EN-US": "Development phases & advantages",
        "ES": "Fases de desarrollo y ventajas"
    },
    "decore Base wurde entworfen um den Entwicklungsprozess deiner Anwendung in seinen verschiedenen Phasen optimal zu unterstützen.": {
        "EN-US": "decore Base was designed to optimally support the development process of your application in its various phases.",
        "ES": "decore Base se ha diseñado para apoyar de forma óptima el proceso de desarrollo de su aplicación en sus distintas fases."
    },
    "** Einige der hier genannten Funktionen sind derzeit noch in direkter Entwicklung und werden in Kürze verfügbar sein.": {
        "EN-US": "** Some of the functions mentioned here are currently still under direct development and will be available shortly.",
        "ES": "** Algunas de las funciones aquí mencionadas están aún en desarrollo directo y estarán disponibles en breve."
    },
    "Beteiligung & Unterstützung": {
        "EN-US": "Participation & support",
        "ES": "Participación y apoyo"
    },
    "Die größte Hilfe, die ich im Moment bekommen kann, ist, wenn Sie einen Blick auf das Projekt werfen und mir sagen, was Sie davon halten. Ich bin für jede Kritik dankbar.": {
        "EN-US": "The biggest help I can get at the moment is if you take a look at the project and tell me what you think of it. I am grateful for any criticism.",
        "ES": "La mayor ayuda que puedo recibir en este momento es que eches un vistazo al proyecto y me digas qué te parece. Agradezco cualquier crítica."
    },
    "Sollte bei Entwickeln etwas nicht wie erwartet funktionieren oder Unklarheiten in der Dokumentation auftauchen, lassen Sie es mich bitte wissen.": {
        "EN-US": "If something does not work as expected during development or if there are any ambiguities in the documentation, please let me know.",
        "ES": "Si algo no funciona como se esperaba durante el desarrollo o si hay alguna ambigüedad en la documentación, hágamelo saber."
    },
    "Bitte benutzen Sie dazu den Problembereich im Repository. `<https://github.com/KemoPanzah/decore_Base/issues>`_": {
        "EN-US": "Please use the problem area in the repository. `<https://github.com/KemoPanzah/decore_Base/issues>`_",
        "ES": "Por favor, utilice el área de problemas en el repositorio. `<https://github.com/KemoPanzah/decore_Base/issues>`_"
    },
    "Sample application": {
        "EN-US": "Sample application",
        "ES": "Ejemplo de solicitud"
    },
    "To better understand how decore base works, it is best to look at the sample application. The application represents my continuous development of decore base.": {
        "EN-US": "To better understand how decore base works, it is best to look at the sample application. The application represents my continuous development of decore base.",
        "ES": "Para entender mejor cómo funciona decore base, lo mejor es echar un vistazo a la aplicación de ejemplo. La aplicación representa mi desarrollo continuo de decore base."
    },
    "https://github.com/KemoPanzah/decore_Sample": {
        "EN-US": "https://github.com/KemoPanzah/decore_Sample",
        "ES": "https://github.com/KemoPanzah/decore_Sample"
    },
    "Schnell erstellte Gui-Dashboard-Anwendungen mit Python, die deinen Ideen mehr Freiraum geben.": {
        "EN-US": "Build fast gui dashboard applications with Python that give your ideas more freedom.",
        "ES": "Aplicaciones Gui dashboard creadas rápidamente con Python que dan más libertad a tus ideas."
    },
    "Get startet": {
        "EN-US": "Get started",
        "ES": "Empezar"
    },
    "Beispiel": {
        "EN-US": "Example",
        "ES": "Ejemplo"
    },
    "Idee & Konzept": {
        "EN-US": "Idea & Concept",
        "ES": "Idea y concepto"
    },
    "Entwicklung & Erweiterung": {
        "EN-US": "Development & expansion",
        "ES": "Desarrollo y expansión"
    },
    "Anpassung & Design": {
        "EN-US": "Customization & Design",
        "ES": "Personalización y diseño"
    },
    "Test & Stabilität": {
        "EN-US": "Test & stability",
        "ES": "Pruebas y estabilidad"
    },
    "Sicherheit & Compliance": {
        "EN-US": "Security & Compliance",
        "ES": "Seguridad y conformidad"
    },
    "Bereitstellung & Veröffentlichung": {
        "EN-US": "Provision & publication",
        "ES": "Suministro y publicación"
    },
    "Marketing & Monetarisierung": {
        "EN-US": "Marketing & Monetization",
        "ES": "Marketing y monetización"
    },
    "Um deinen Ideen maximale Freiheit zu geben, ist decore Base im ersten Schritt praktisch sofort einsatzbereit. Du musst dich nicht um die GUI, Datenbankfunktionalitäten, Sicherheitsaspekte oder viele andere Details kümmern. Feinere Anpassungen kannst du im nächsten Schritt entsprechend deinen Anforderungen vornehmen. Konzentriere dich vollständig auf deine Ideen und die Umsetzung deiner Algorithmen.": {
        "EN-US": "To give your ideas maximum freedom, decore Base is practically ready to use in the first step. You don't have to worry about the GUI, database functionalities, security aspects or many other details. You can make finer adjustments in the next step according to your requirements. Concentrate fully on your ideas and the implementation of your algorithms.",
        "ES": "Para dar la máxima libertad a sus ideas, decore Base está prácticamente listo para usar en el primer paso. No tiene que preocuparse por la interfaz gráfica de usuario, las funcionalidades de la base de datos, los aspectos de seguridad ni muchos otros detalles. En el siguiente paso podrá realizar ajustes más precisos en función de sus necesidades. Concéntrese plenamente en sus ideas y en la implementación de sus algoritmos."
    },
    "Programmiere deine Anwendung im objektorientierten Stil, denn Benutzer-Aktionen aus dem Frontend werden in deinen Basisinstanzen ausgeführt. Dekoriere einfach Python-Funktionen mit einer klaren Syntax und ermögliche so das organische Wachsen deiner GUI-Anwendung. Erweitere deine Anwendung um neue Funktionen und schöpfe dabei aus dem vollen Potenzial von Python und seinen Bibliotheken.": {
        "EN-US": "Program your application in object-oriented style, because user actions from the frontend are executed in your base instances. Simply decorate Python functions with a clear syntax, allowing your GUI application to grow organically. Extend your application with new functions and draw on the full potential of Python and its libraries.",
        "ES": "Programe su aplicación en estilo orientado a objetos, ya que las acciones del usuario desde el frontend se ejecutan en sus instancias base. Decore simplemente las funciones de Python con una sintaxis clara, permitiendo que su aplicación GUI crezca orgánicamente. Amplíe su aplicación con nuevas funciones y utilice todo el potencial de Python y sus bibliotecas."
    },
    "Entdecke mühelos und zügig den grundlegenden UI-Stil und passe ihn anschließend ganz nach deinen Anforderungen an. Integriere zusätzlich Template-Code**, um sicherzustellen, dass deine Anwendung nicht nur Daten verarbeitet, sondern auch ein individuelles Erscheinungsbild annimmt. Verleihe deiner Benutzeroberfläche deinen persönlichen Stil mithilfe eigener Sheets**.": {
        "EN-US": "Easily and quickly discover the basic UI style and then customize it according to your requirements. Integrate additional template code** to ensure that your application not only processes data, but also takes on an individual appearance. Give your user interface your own personal style using your own sheets**.",
        "ES": "Descubra fácil y rápidamente el estilo básico de la interfaz de usuario y, a continuación, personalícelo según sus necesidades. Integre código de plantilla adicional** para garantizar que su aplicación no sólo procese datos, sino que también adopte un aspecto personalizado. Dote a su interfaz de usuario de un estilo personal mediante hojas personalizadas**."
    },
    "Gewährleiste die Stabilität und Qualität deiner Anwendung durch eine sorgfältige Überprüfung ihrer Funktionalitäten mithilfe eingebauter Testmethoden**. Diese Tests ermöglichen es, die erwarteten Ergebnisse sicherzustellen und die Performance der Anwendung zu optimieren.": {
        "EN-US": "Ensure the stability and quality of your application by carefully checking its functionalities using built-in test methods**. These tests make it possible to ensure the expected results and optimize the performance of the application.",
        "ES": "Garantice la estabilidad y la calidad de su aplicación comprobando cuidadosamente sus funcionalidades mediante métodos de prueba integrados**. Estas pruebas permiten garantizar los resultados esperados y optimizar el rendimiento de la aplicación."
    },
    "Nutze das eingebaute Sitzungsmanagement und übertrage Daten verschlüsselt** in deine Anwendung. Implementiere eigene Modelle für die Erfassung sensibler und persönlicher Benutzerdaten. Setze die integrierte Benutzerverwaltung** ein, um Rollen und Besitzrechte zu verwalten.": {
        "EN-US": "Use the built-in session management and transfer encrypted data** to your application. Implement your own models for capturing sensitive and personal user data. Use the integrated user administration** to manage roles and ownership rights.",
        "ES": "Utilice la gestión de sesiones incorporada y transfiera datos cifrados** a su aplicación. Implemente sus propios modelos para capturar datos sensibles y personales de los usuarios. Utilice la administración de usuarios integrada** para gestionar las funciones y los derechos de propiedad."
    },
    "decore Base wird auch in dieser Entwicklungsphase künftig unterstützende Funktionen bieten. Bald werden Features wie die Electron-Integration** verfügbar sein, mit der du deine Anwendung ganz einfach als Desktop-App veröffentlichen kannst.": {
        "EN-US": "decore Base will also offer supporting functions in this development phase in the future. Features such as Electron integration** will soon be available, allowing you to easily publish your application as a desktop app.",
        "ES": "decore Base también ofrecerá funciones de apoyo en esta fase de desarrollo en el futuro. Pronto estarán disponibles funciones como la integración con Electron**, que le permitirá publicar fácilmente su aplicación como una app de escritorio."
    },
    "Gewährleiste die Sichtbarkeit und Auffindbarkeit deiner Anwendung durch ein SEO**-freundliches Frontend. Baldige Implemetierungen berücksichtigen subtile und benutzerfreundliche Werbemöglichkeiten**, die nahtlos in das Anwendererlebnis integriert sind.": {
        "EN-US": "Ensure the visibility and findability of your application through an SEO**-friendly frontend. Soon implementations will include subtle and user-friendly advertising options** that are seamlessly integrated into the user experience.",
        "ES": "Garantice la visibilidad y facilidad de localización de su aplicación mediante un frontend compatible con SEO**. Próximamente, las implementaciones incluirán opciones publicitarias sutiles y fáciles de usar** que se integran a la perfección en la experiencia del usuario."
    },
    "Idee & Konzepto": {
        "EN-US": "Idea & concept"
    },
    "Parámetros": {
        "ES": "Parámetros"
    }
}