Repository: KemoPanzah/decore_Page_Old
Catalog: source/_locale/*/LC_MESSAGES/docs.po
Languages: es

source: Dokumentation
es: Documentación

source: Um mit decore Base eine lauffähige GUI-Dashboard-Anwendung zu erstellen, sind vergleichsweise wenige Schritte notwendig. Im Wesentlichen besteht der Aufbau aus der Definition der Meta-Instanzen und der Definition des Datenmodells. Die Metadaten werden vom Interpreter durch Einlesen von dekorierten Funktionen zusammengestellt und als Instanzen im Pool gespeichert.
es: Para crear una aplicación de cuadro de mando GUI ejecutable con decore Base, son necesarios comparativamente pocos pasos. Esencialmente, la estructura consiste en definir las meta instancias y definir el modelo de datos. Los metadatos son compilados por el intérprete mediante la lectura de funciones decoradas y guardados como instancias en el pool.

source: Beschreibung der Meta-Instanzen
es: Descripción de las metainstancias

source: Meta-Instanzen entahlten die benötigten Typen und Attribute für die Erstellung der GUI-Elemente. Die Meta-Instanzen werden in der Regel durch dekorierte Funktionen erstellt.
es: Las metainstancias contienen los tipos y atributos necesarios para crear los elementos GUI. Las metainstancias suelen crearse mediante funciones decoradas.

source: App
es: Aplicación

source: Die Application-Instanz liefert die Metadaten für den Anwendung. Sie ist die Wurzel für alles kommende und nimmt nur Basen auf. Die App-Instanz wird durch den "Decorator" :meth:`app() <decore_Base.decore_base.decore.Decore.app>` erstellt.
es: La instancia de aplicación proporciona los metadatos de la aplicación. Es la raíz de todo lo que vendrá y sólo acepta bases. La instancia de aplicación se crea mediante el "Decorator" :meth:`app() <decore_Base.decore_base.decore.Decore.app>`.

source: Die Base-Instanz liefert die Metadaten für die Basis. Sie ist das Trägerelement für die Ansichten. Die Base-Instanz wird durch den "Decorator" :meth:`base() <decore_Base.decore_base.decore.Decore.base>` erstellt.
es: La instancia base proporciona los metadatos para la base. Es el elemento portador de las vistas. La instancia base se crea mediante el "Decorator" :meth:`base() <decore_Base.decore_base.decore.Decore.base>`.

source: **Darstellung im Frontend**
es: **Visualización en la parte frontal**

source: Die Basis ist im Grunde die freie Fläche die für die Ansichten zur Verfügung steht.
es: La base es básicamente la zona libre que queda disponible para las vistas.

source: In der Navigation wird sie direkt unter Wurzel gelistet sobald sie mehr als eine Ansicht erhält.
es: Aparece directamente debajo de Raíz en la navegación en cuanto recibe más de una vista.

source: View
es: Ver

source: Die View-Instanz liefert die Metadaten für die Ansicht. Ihr können Aktionen und Dialoge untergeordnet werden. Die View-Instanz wird durch den "Decorator" :meth:`view() <decore_Base.decore_base.decore.Decore.view>` erstellt.
es: La instancia de vista proporciona los metadatos de la vista. A ella se pueden subordinar acciones y diálogos. La instancia de vista se crea mediante el "Decorador" :meth:`view() <decore_Base.decore_base.decore.Decore.view>`.

source: Die unterschiedlichen Ansichts-Typen werden im Bereich :doc:`Typen<documentation/types>` näher beschrieben.
es: Los distintos tipos de vistas se describen con más detalle en la sección :doc:`Tipos<documentación/tipos>`.

source: Die Ansicht wird in der Navigation unter der Basis gelistet.
es: La vista aparece en la navegación bajo la base.

source: Die Ansicht wird im Ansichtsbereich der Basis gerendert.
es: La vista se renderiza en el área de vista de la base.

source: Dialog
es: Diálogo

source: Die Dialog-Instanz liefert die Metadaten für den Dialog. Ihr können weitere Dialoge untergeordnet werden die dann in Tabs dargetellt werden. Hauptsächlich dienen diese aber zum tragen der Widgets. Die Dialog-Instanz wird durch den "Decorator" :meth:`dialog() <decore_Base.decore_base.decore.Decore.dialog>` erstellt.
es: La instancia de diálogo proporciona los metadatos del diálogo. Se le pueden subordinar otros diálogos, que se muestran en pestañas. Sin embargo, éstas se utilizan principalmente para llevar los widgets. La instancia de diálogo se crea mediante el "Decorador" :meth:`dialog() <decore_Base.decore_base.decore.Decore.dialogue>`.

source: Auch hier gibt es verschiedene Dialog-Typen die im Bereich :doc:`Typen<documentation/types>` näher beschrieben werden.
es: Aquí también hay varios tipos de diálogo que se describen con más detalle en la sección :doc:`Tipos<documentación/tipos>`.

source: Der Dialog kann in unterschiedlichen Display-Modis dargestellt werden. Zum Beispiel als Side-Drawer oder als modales Fenster.
es: El diálogo puede mostrarse en diferentes modos de visualización. Por ejemplo, como ventana lateral o como ventana modal.

source: Dieser wird durch die mit dem Aktivator-Attribut bestimmten Postionen oder Ereignisse aufgerufen.
es: Es llamado por las posiciones o eventos definidos con el atributo activador.

source: Die Widget-Instanz liefert die Metadaten für das Widget. Ihr können weitere Widgets untergeordnet werden die dann gestapelt dargetellt werden. Ein Widget wird für die Manipulation des Datensatzes oder Datensätze benötigt. Die Widget-Instanz wird durch den "Decorator" :meth:`widget() <decore_Base.decore_base.decore.Decore.widget>` erstellt.
es: La instancia del widget proporciona los metadatos del widget. Se le pueden subordinar otros widgets, que se mostrarán en una pila. Se necesita un widget para manipular el conjunto o conjuntos de datos. La instancia de widget se crea mediante el "Decorador" :meth:`widget() <decore_Base.decore_base.decore.Decore.widget>`.

source: Widgets können beispielsweise ein Editor ein Viewer, Listen, oder Diagramme sein. Die unterschiedlichen Widget-Typen werden im Bereich :doc:`Typen<documentation/types>` näher beschrieben.
es: Los widgets pueden ser un editor, un visor, listas o diagramas, por ejemplo. Los distintos tipos de widgets se describen con más detalle en la sección :doc:`Tipos<documentación/tipos>`.

source: Das Widget wird im Content-Bereich des Dialoges dargestellt.
es: El widget se muestra en el área de contenido del diálogo.

source: Action
es: Acción

source: Die Action-Instanz liefert die Metadaten für die Aktion. Sie ist das Schlußlicht in der Prozesskette der Meta-Abarbeitung und dient zum übermitteln der Manipulationen und der Ausführung von Aktionen im Backend. Die Action-Instanz wird durch den "Decorator" :meth:`action() <decore_Base.decore_base.decore.Decore.action>` erstellt.
es: La instancia de acción proporciona los metadatos de la acción. Es el último eslabón de la cadena de metaprocesamiento y se utiliza para transmitir las manipulaciones y la ejecución de acciones en el backend. La instancia de acción se crea mediante el "Decorator" :meth:`action() <decore_Base.decore_base.decore.Decore.action>`.

source: Auch Aktionen haben Typen die im Bereich :doc:`Typen<documentation/types>` näher beschrieben werden. Ein Besispiel wäre der Typ ``submit`` der bestimmte Daten (z.B. Item, Selektierte Items oder Strukturen) an das Backend übermittelt.
es: Las acciones también tienen tipos que se describen con más detalle en la sección :doc:`Types<documentation/types>`. Un ejemplo sería el tipo ``submit`` que transmite ciertos datos (por ejemplo, elemento, elementos seleccionados o estructuras) al backend.

source: Aktionen können durch das Aktivator-Attribut an unterschiedlichen Stellen im Frontend positioniert werden, haben aber keine tatächliche Darstellung sondern nur Schaltflächen- oder Ereignisgesteuerte Trigger.
es: Las acciones pueden posicionarse en diferentes lugares del frontend utilizando el atributo activator, pero no tienen una visualización real, sólo activadores controlados por botones o eventos.

source: Function
es: Función

source: Die Function-Instanz liefert die Metadaten für Funktionen die nach dem Init des Pools direkt in der Base als Instanz-Methoden ausgeführt werden. Die Function-Instanz wird durch den "Decorator" :meth:`function() <decore_Base.decore_base.decore.Decore.function>` erstellt.
es: La instancia de función proporciona los metadatos para las funciones que se ejecutan directamente en la base como métodos de instancia después del pool init. La instancia de función se crea mediante el "Decorator" :meth:`function() <decore_Base.decore_base.decore.Decore.function>`.

source: Funktionen werden nicht im Frontend dargestellt oder aufgearbeitet.
es: Las funciones no se visualizan ni se procesan en el front end.

source: Abarbeitungsreihenfolge im Frontend
es: Secuencia de procesamiento en el frontend

source: Nach dem Öffnen einer Anwendung, dem Anlegen der Base und dem Anlegen weiterer Childs laufen alle Pfade auf die Action zu, die schließlich wieder mit dem Backend kommuniziert, um die Manipulation der Daten zu ermöglichen. Nicht jedes Komponentenobjekt kann einem anderen beliebig zugeordnet werden. Das Frontend arbeitet die einzelnen Objekte nur in einer festen Reihenfolge ab.
es: Tras abrir una aplicación, crear la base y crear más hijos, todos los caminos conducen a la acción, que vuelve a comunicarse con el backend para permitir la manipulación de los datos. No todos los objetos componentes pueden asignarse arbitrariamente a otro. El front end sólo procesa los objetos individuales en un orden fijo.

source: Diese Übersicht stellt den Prozess dieser Abarbeitung dar.
es: Este resumen muestra el proceso de este tratamiento.

source: Relationale Datenverarbeitung im Widget
es: Tratamiento relacional de datos en el widget

source: Die Datenverarbeitung und Datensatzgenerierung in den Widgets ist ein wichtiger Bestandteil der Anwendung und wird hier als Relationale-Datenverarbeitung bezeichnet. Diese Generierung des bearbeitbaren Datensatzes, wird erstens durch den Aktivator und zweitens durch die Datenquelle der Ansicht in Beziehung zur Datenquelle des Widgets gesteuert. Damit wird ermöglicht, einen Dialog mit weiter im Kontext der eigentlichen Selektion zu erweitern und detailreicher zu gestalten.
es: El tratamiento de datos y la generación de conjuntos de datos en los widgets es una parte importante de la aplicación y se denomina aquí tratamiento relacional de datos. Esta generación del conjunto de datos editables está controlada en primer lugar por el activador y en segundo lugar por la fuente de datos de la vista en relación con la fuente de datos del widget. Esto permite ampliar un diálogo con más en el contexto de la selección real y hacerlo más detallado.

source: Folgender Chart beschreibt diesen Prozess.
es: El siguiente cuadro describe este proceso.

source: Legende:
es: Leyenda:

source: **Item**
es: **Artículo**

source: empty = ein leerer Datensatz wird generiert. (keine Default-Werte).
es: empty = se genera un registro de datos vacío. (sin valores por defecto).

source: first = der erste Datensatz der Widget-Quelle wird als Datensatz geladen.
es: first = el primer registro de datos de la fuente del widget se carga como un registro de datos.

source: last = der letzte Datensatz der Widget-Quelle wird als Datensatz geladen.
es: last = el último registro de datos de la fuente del widget se carga como un registro de datos.

source: default = ein neuer Datensatz mit Default-Werten der Widget-Quelle wird als Datensatz geladen.
es: default = un nuevo conjunto de datos con valores por defecto de la fuente del widget se carga como un conjunto de datos.

source: item_by_id = ein Datensatz mit einer definierten ID aus der Widget-Quelle wird als Datensatz geladen.
es: item_by_id = un registro de datos con un ID definido de la fuente del widget se carga como un registro de datos.

source: **Query**
es: **Consulta**

source: True = Alle vorkommenden Backref-Namen und die ID des selektierten Datensatzes der Ansichts-Quelle wird genutzt, um die Query des Widgets zu erweitern.
es: True = Todos los nombres de referencia que aparecen y el ID del registro de datos seleccionado de la fuente de la vista se utilizan para ampliar la consulta del widget.

source: False = Die ID des selektierten Datensatzes wird nicht als Query-Attribut für den Datenabruf verwendet.
es: Falso = El ID del registro de datos seleccionado no se utiliza como atributo de consulta para la recuperación de datos.

source: **Extend**
es: **Extender**

source: True = automatische Befüllung der relationalen Felder des Ziel-Datensatzes, mit dem Ansichts-Datensatz. Zum Beispiel: Ein ForeignKey-Feld des Ziel-Datanstaz wird mit dem Ansichst-Datenstaz befüllt.
es: Verdadero = relleno automático de los campos relacionales del conjunto de datos de destino con el conjunto de datos de la vista. Por ejemplo: un campo ForeignKey del conjunto de datos de destino se rellena con el conjunto de datos de la vista.

source: False = keine automatische Befüllung des Datensatzes.
es: Falso = no se rellena automáticamente el registro de datos.

source: Decorators
es: Decoradores

source: Objekt der Klasse Decore ist die Hauptklasse des Frameworks. Sie ist für die Registrierung der Elemente zuständig und stellt die API zur Verfügung.
es: Objeto de clase Decore es la clase principal del framework. Se encarga de registrar los elementos y proporciona la API.

source: Eine Funktion zum eröffnen einer GUI-Dashboard-Anwendung. Sie wird als "Decorator" verwendet.
es: Una función para abrir una aplicación de cuadro de mando GUI. Se utiliza como "Decorador".

source: Der Titel der App.
es: El título de la aplicación.

source: Gibt an, ob der Gastzugang (Anonynus) erlaubt ist. Der Wert ``True`` erlaubt den automatischen Login als Gast. Der Wert ``False`` verweigert das senden der Metadaten an das Frontend und verweist auf die Login-Seite.
es: Especifica si se permite el acceso de invitados (anonynus). El valor ``True`` permite el inicio de sesión automático como invitado. El valor ``False`` rechaza enviar los metadatos al frontend y remite a la página de inicio de sesión.

source: Eine Funktion zum registrieren einer Basis in der GUI-Dashboard-Anwendung. Sie wird als "Decorator" verwendet.
es: Una función para registrar una base en la aplicación GUI dashboard. Se utiliza como un "Decorador".

source: Die Basis ist das Trägerelement für die Ansicht und die Vorlage für die Datenquelle im Frontend.
es: La base es el elemento portador para la vista y la plantilla para la fuente de datos en el front-end.

source: Das Symbol der Basis.
es: El símbolo de la base.

source: Der Titel der Basis.
es: El título de la base.

source: Die Beschreibung der Basis.
es: La descripción de la base.

source: Das Datenmodell der Basis.
es: El modelo de datos de la base.

source: Eine Funktion zur Registrierung einer Ansicht. Sie wird als "Decorator" verwendet.
es: Una función para registrar una vista. Se utiliza como "Decorador".

source: Eine Ansicht ist ein Container für die Anzeige von Daten.
es: Una vista es un contenedor para mostrar datos.

source: Die ID des übergeordneten Elements. Nur zu setzen, wenn die Ansicht in einer anderen Basis gerendert werden soll.
es: El ID del elemento padre. Sólo debe establecerse si la vista se va a renderizar en una base diferente.

source: Das Symbol der Ansicht.
es: El símbolo de la vista.

source: Der Titel der Ansicht.
es: El título de la vista.

source: Die Beschreibung der Ansicht.
es: La descripción de la vista.

source: Gibt an wie die Datensätze angezeigt werden. Der Wert ``table`` stellt die Datensätze in einer Tabelle dar.
es: Especifica cómo se muestran los registros de datos. El valor ``table`` representa los registros de datos en una tabla.

source: Die Felder, die in der Ansicht angezeigt werden.
es: Los campos que se muestran en la vista.

source: Die Filter, die in der Ansicht angezeigt werden.
es: Los filtros que se muestran en la vista.

source: Die Abfrage, die in der Ansicht angezeigt wird.
es: La consulta que se muestra en la vista.

source: Wählt die Methode wie die Datensätze der View geladen werden. Der Wert ``client`` lädt alle Datensätze auf einmal und überlässt den Seitenaufbau dem Frontend.
es: Selecciona el método para cargar los registros de datos de la vista. El valor ``client`` carga todos los registros de datos a la vez y deja la estructura de la página al frontend.

source: Gibt an wieviele Datensätze auf einer Seite der Ansicht angezeigt werden sollen. ``16`` ist die Standardeinstellung.
es: Especifica cuántos registros de datos deben mostrarse en una página de la vista. ``16`` es el valor predeterminado.

source: Eine Funktion zur Registrierung eines Dialogs. Sie wird als "Decorator" verwendet.
es: Función para registrar un diálogo. Se utiliza como "Decorador".

source: Der Dialog ist das Trägerelement für Widgets
es: El diálogo es el elemento portador de los widgets

source: Die ID des übergeordneten Elements. Nur zu setzen, wenn der Dialog in einer Ansicht einer anderen Basis gerendert werden soll.
es: El ID del elemento padre. Sólo debe establecerse si el diálogo se va a representar en una vista de otra base.

source: Das Symbol des Dialogs.
es: El símbolo del diálogo.

source: Der Titel des Dialogs.
es: El título del diálogo.

source: Die Beschreibung des Dialogs.
es: La descripción del diálogo.

source: Gibt an wie der Dialog die Widgets darstellen wird. Der Wert ``standard`` stellt die untergeordneten Widgets und Sub-Widgets untereinander dar.
es: Especifica cómo mostrará el diálogo los widgets. El valor ``estándar`` muestra los widgets y sub-widgets subordinados uno debajo de otro.

source: Der Anzeigetyp des Dialogs. Standardwert ist ``draw-half``.
es: Tipo de visualización del diálogo. El valor por defecto es ``draw-half``.

source: Der Aktivatortyp des Dialogs. Über den Wert ``none`` wird der Dialog sofort beim OnLoad Ereignis der View angezeigt. Der Wert ``default`` stellt den Dialog im Top-Menu der View dar. Der Wert ``context`` stellt den Dialog im Kontextmenü eines Items der View dar. Der Wert ``click`` zeigt den Dialog dann an wenn man einen Datensatz anklickt.
es: El tipo de activador del diálogo. Con el valor ``none`` el diálogo se muestra inmediatamente en el evento OnLoad de la vista. El valor ``default`` muestra el diálogo en el menú superior de la vista. El valor ``context`` representa el diálogo en el menú contextual de un elemento de la vista. El valor ``click`` muestra el diálogo cuando se hace clic sobre un registro de datos.

source: Eine Funktion zur Registrierung eines Widgets. Sie wird als "Decorator" verwendet.
es: Una función para registrar un widget. Se utiliza como "Decorador".

source: Ein Widget dient zur Darstellung und Interaktion mit dem Datensatz. Es erhält die Daten, die der Dialog-Aktivator vorgibt. Der Wert ``none`` übergibt den letzten Datensatz der Datenbanktabelle. Der Wert ``default`` übergibt einen nur mit Default-Werten gefüllten Datensatz. Beim Wert ``context`` übergibt es den Datensatz, der im Kontextmenü der Ansicht ausgewählt wurde. Und ``click`` übergibt den Datensatz, der angeklickt wurde.
es: Un widget se utiliza para mostrar e interactuar con el conjunto de datos. Recibe los datos especificados por el activador del diálogo. El valor ``none`` transfiere el último registro de datos de la tabla de la base de datos. El valor ``default`` transfiere un registro de datos rellenado sólo con valores por defecto. El valor ``context`` transfiere el registro de datos seleccionado en el menú contextual de la vista. Y ``click`` transfiere el registro de datos sobre el que se ha hecho clic.

source: Widgets, welche aus einer fremden Basis einem Dialog zugeordnet werden, ergänzen die relationalen Felder eines Default-Items der fremden Datenquelle mit den Daten des aktivierten Items. (Der Satz ist Scheiße zu verstehen, aber er trifft genau das, was es tut). In der Sample Anwendung verwende ich das beim Zuweisen von "Contracts" zu einer "Person".
es: Los widgets, que se asignan a un diálogo desde una base ajena, complementan los campos relacionales de un elemento predeterminado de la fuente de datos ajena con los datos del elemento activado. (La frase es una mierda de entender, pero hace exactamente lo que hace). En la aplicación de ejemplo, utilizo esto al asignar "Contratos" a una "Persona".

source: Es gibt aber auch Widgets, die mehrere Datensätze darstellen können, wie im Beispiel davor werden hier auch die Relationen verwendet, um nur Daten abzubilden, die etwas mit dem gewählten Item zu tun haben.
es: Sin embargo, también hay widgets que pueden mostrar varios registros de datos. Como en el ejemplo anterior, aquí también se utilizan las relaciones para mostrar sólo los datos que tienen algo que ver con el elemento seleccionado.

source: Die ID des übergeordneten Elements. Nur zu setzen, wenn das Widget in einem Dialog einer anderen Basis gerendert werden soll.
es: El ID del elemento padre. Sólo debe establecerse si el widget se va a renderizar en un diálogo de otra base.

source: Das Symbol des Widgets.
es: El icono del widget.

source: Der Titel des Widgets.
es: El título del widget.

source: Die Beschreibung des Widgets.
es: La descripción del widget.

source: Gibt an wie das Widget die Daten darstellen wird. Standardwert ist ``default``.
es: Especifica cómo mostrará los datos el widget. El valor por defecto es ``default``.

source: Die Felder, die in dem Widget angezeigt werden.
es: Los campos que se muestran en el widget.

source: Eine Funktion zur Registrierung einer Aktion. Sie wird als "Decorator" verwendet.
es: Una función para registrar una acción. Se utiliza como "Decorador".

source: Eine Aktion ist die tatsächliche Interaktion zwischen dem Benutzer und dem Backend.
es: Una acción es la interacción real entre el usuario y el backend.

source: Die ID des übergeordneten Elements. Nur zu setzen, wenn die Aktion in einem Widget einer anderen Basis gerendert werden soll.
es: El ID del elemento padre. Solo debe establecerse si la acción se va a renderizar en un widget de otra base.

source: Das Symbol der Aktion.
es: El símbolo de la acción.

source: Der Titel der Aktion.
es: El título de la campaña.

source: Die Beschreibung der Aktion.
es: La descripción de la acción.

source: Gibt an was die Aktion kann. Standardwert ist ``standard``.
es: Especifica lo que puede hacer la acción. El valor por defecto es ``standard``.

source: Gib an, wie die Aktion ausgelöst wird.
es: Especifique cómo se desencadena la acción.

source: Gibt an, ob die Aktion Validierungsfehler zurückgeben kann. Standardwert ist ``True``. (Im Augenblick wirkt sich das nur auf den Typen ``submit`` aus.)
es: Especifica si la acción puede devolver errores de validación. El valor por defecto es ``True``. (Por el momento, esto sólo afecta al tipo ``submit``).

source: Die Aktionen durchlaufen ein Modul, welches die erhaltenen Daten aufbereitet und als Keyword-Parameter an die dekorierte Funktion übergibt. Es ist alles in den ``kwargs`` zu finden und man macht sich diese einfach verfügbar. Der Parameter ``item`` ist ein Beispiel dafür und repräsentiert den vom Frontend zurückgegebenen Datensatz. Um herauszufinden, was alles noch in den ``kwargs`` steckt, bitte den Debugger benutzen.
es: Las acciones se ejecutan a través de un módulo que prepara los datos recibidos y los pasa a la función decorada como parámetros de palabra clave. Todo se encuentra en los ``kwargs`` y simplemente hay que ponerlos a disposición. El parámetro ``item`` es un ejemplo de esto y representa el conjunto de datos devueltos por el frontend. Para saber qué más hay en los ``kwargs``, utiliza el depurador.

source: Eine Funktion zur Registrierung einer Funktion in der übergeordneten Base. Sie wird als "Decorator" verwendet.
es: Una función para registrar una función en la base padre. Se utiliza como "Decorador".
