Repository: KemoPanzah/decore_Page_Old
Catalog: source/_locale/*/LC_MESSAGES/docs.po
Languages: es

source: Eine Funktion wird direkt nach der Zusammenstellung des Metadaten-Pool ausgeführt. Mit Funktionen kann man die Logik erweitern, Dinge vorbereiten oder Hintergrundaufgaben erledigen. Sie agieren als Instanzmethoden der Basis und erhalten damit den objektorientierten Ansatz.
es: Una función se ejecuta directamente después de compilar el conjunto de metadatos. Las funciones pueden utilizarse para ampliar la lógica, preparar cosas o realizar tareas en segundo plano. Actúan como métodos de instancia de la base y mantienen así el enfoque orientado a objetos.

source: Gibt an wie eine Funktion ausgeführt wird. Mit dem Wert ``shot`` wird sie nur einmal ausgeführt. Der Wert ``work`` wird in einem Thread ausgeführt und kann somit Schleifen abarbeiten die niemals enden bis der Main-Thread endet.
es: Especifica cómo se ejecuta una función. Con el valor ``shot`` sólo se ejecuta una vez. El valor ``work`` se ejecuta en un hilo y por lo tanto puede procesar bucles que nunca terminan hasta que el hilo principal termina.

source: Felder
es: Campos

source: The BackRefMetaField's name must match the name of the specified backref in the ForeignKey or ManyToMany field in the reference model.
es: El nombre del BackRefMetaField debe coincidir con el nombre del backref especificado en el campo ForeignKey o ManyToMany del modelo de referencia.

source: The BackRefMetaField is used by the user to represent relationships in the **decore Front** application. For example, it can be assigned to the filter or to a form. It is a MetaField and does not get a column in the database.
es: El BackRefMetaField es utilizado por el usuario para representar relaciones en la aplicación **decore Front**. Por ejemplo, se puede asignar al filtro o a un formulario. Es un MetaField y no obtiene una columna en la base de datos.

source: A human-readable name for the field.
es: Un nombre legible para el campo.

source: Additional text to be displayed in **decore Front**.
es: Texto adicional que debe aparecer en **decore Front**.

source: A List of type string. Only the speciefied fields will be displayed in the filter. If None, all fields will be displayed.
es: Una lista de tipo cadena. Sólo se mostrarán en el filtro los campos especificados. Si es Ninguno, se mostrarán todos los campos.

source: A dictonary containing a query to be used when querying options (e.g. in selection fields in the frontend). The query always refers to the reference model.
es: Un diccionario que contiene una consulta que se utilizará al consultar opciones (por ejemplo, en los campos de selección del frontend). La consulta siempre hace referencia al modelo de referencia.

source: A field to store boolean values.
es: Un campo para almacenar valores booleanos.

source: If True, the field is allowed to be null. Defaults to False.
es: Si es True, se permite que el campo sea nulo. Por defecto es False.

source: The default value for the field. Defaults to None.
es: Valor por defecto del campo. Por defecto es Ninguno.

source: A field to store char values.
es: Un campo para almacenar valores char.

source: If True, the field must be unique in database table. Defaults to False.
es: Si es True, el campo debe ser único en la tabla de la base de datos. Por defecto es False.

source: A field to store date values.
es: Un campo para almacenar valores de fecha.

source: A field to store datetime values.
es: Un campo para almacenar valores de fecha y hora.

source: A field to store float values.
es: Un campo para almacenar valores flotantes.

source: A field to represent a one-to-many relationship between two models.
es: Campo que representa una relación uno a muchos entre dos modelos.

source: The model to which the relationship is to be established.
es: El modelo con el que se establecerá la relación.

source: The name of the field in the reference model that represents the relationship to the model.
es: Nombre del campo del modelo de referencia que representa la relación con el modelo.

source: A dictonary containing a query to be used when querying choices (e.g. in selection fields in the frontend). The query always refers to the reference model.
es: Un diccionario que contiene una consulta que se utilizará al consultar las opciones (por ejemplo, en los campos de selección del frontend). La consulta siempre hace referencia al modelo de referencia.

source: A field to store integer values.
es: Un campo para almacenar valores enteros.

source: A field to represent a many-to-many relationship between two models. It is a MetaField and does not get a column in the database. However, a through model is created by decore Base, which represents the relationship between the two models.
es: Un campo para representar una relación muchos-a-muchos entre dos modelos. Es un MetaField y no obtiene una columna en la base de datos. Sin embargo, se crea un modelo a través de decore Base, que representa la relación entre los dos modelos.

source: The keybase is a KeePass file and should be protected by setting the correct access rights (ACL).
es: La base de claves es un archivo KeePass y debe protegerse estableciendo los derechos de acceso correctos (ACL).

source: A field to store passwords in the keybase and to use them again.
es: Un campo para almacenar contraseñas en la base de claves y volver a utilizarlas.

source: A field to store text values.
es: Un campo para almacenar valores de texto.

source: create dashbord with python fastly
es: crear dashbord con python fastly

source: python gui, decore, python database, python dashboard, python orm, python ui, dashboard creation, python application, ui framework, ui toolkit
es: python gui, decore, python database, python dashboard, python orm, python ui, creación dashboard, python application, ui framework, ui toolkit

source: Erste Schritte
es: Primeros pasos

source: Um die schnelle GUI-Dashboard-Erstellung, mit decore Base in Python, zu veranschaulichen werden wir nun gemeinsam eine kleine UI in Form einer Webanwendung erstellen.
es: Para ilustrar la rápida creación de cuadros de mando GUI con decore Base en Python, vamos a crear juntos una pequeña UI en forma de aplicación web.

source: Die dekorierten Funktionen dienen, in allererster Linie, der Erstellung von Metainformationen für die spätere Auswertung im Frontend der Anwendung und sind nichts, wovor man sich fürchten muss.
es: Las funciones decoradas se utilizan principalmente para crear metainformación para su posterior evaluación en el front-end de la aplicación y no son nada que temer.

source: *Es ist wirklich einfach, bitte folgen Sie mir!*
es: *Es muy sencillo, ¡por favor sígueme!

source: Installation
es: Instalación

source: Erstellen Sie zunächst ein leeres Python-Projekt in Ihrem gewünschten Verzeichnis.
es: Primero crea un proyecto Python vacío en el directorio que desees.

source: Um decore Base zu installieren, führen wir den folgenden Befehl im Stammverzeichnis des Projekts aus. Verwenden wir das Terminal in vscode.
es: Para instalar decore Base, ejecutamos el siguiente comando en el directorio raíz del proyecto. Vamos a utilizar el terminal en vscode.

source: Dies erfordert eine aktivierte Python-Umgebung! Um mehr darüber zu erfahren, besuchen Sie `Python-Umgebungen in VS Code <https://code.visualstudio.com/docs/python/environments>`_.
es: Esto requiere un entorno Python activado. Para saber más sobre esto, visita `Entornos Python en VS Code <https://code.visualstudio.com/docs/python/environments>`_.

source: Vorbereitung
es: Preparación

source: Um für unsere zukünftige Python GUI-Dashboard-Anwendung alles nötige an Pfaden und Einstellungen zu erhalten, müssen wir noch die Vorbereitung durchführen.
es: Con el fin de obtener todas las rutas y configuraciones necesarias para nuestra futura aplicación Python GUI dashboard, todavía tenemos que llevar a cabo la preparación.

source: Erstellen wir nun eine neue Datei mit dem Namen **app.py** im Hauptverzeichnis des Projekts.
es: Creemos ahora un nuevo archivo con el nombre **app.py** en el directorio principal del proyecto.

source: Um decore zu verwenden, importieren wir es zunächst in das Modul **app.py**.
es: Para utilizar decore, primero lo importamos en el módulo **app.py**.

source: Dann verwenden wir den Befehl ``prepare``, um alle erforderlichen Hilfsdateien im Stammverzeichnis des Projekts zu erstellen.
es: A continuación, utilizamos el comando ``prepare`` para crear todos los archivos auxiliares necesarios en el directorio raíz del proyecto.

source: Um nun die Anwendung tatsächlich vorzubereiten, führen wir den Befehl ``python app.py --prepare`` im Terminal aus. Der Pfad muss im Hauptverzeichnis des Projekts liegen, also dort wo sich die **app.py** befindet.
es: Para preparar realmente la aplicación, ejecutamos el comando ``python app.py --prepare`` en el terminal. La ruta debe estar en el directorio raíz del proyecto, es decir, donde se encuentra el **app.py**.

source: Verwendung
es: Utilización

source: Damit der Python-Interpreter die zukünftigen Basisklassen verarbeiten kann, fügen wir den folgenden Import hinzu.
es: Para que el intérprete de Python pueda procesar las futuras clases base, añadimos el siguiente import.

source: Normalerweise enthält ein Python-Hauptmodul eine Abfrage, die prüft, ob es das Hauptmodul ist, so dass wir anschließend die Funktion ``main`` aufrufen können.
es: Normalmente, un módulo principal de Python contiene una consulta que comprueba si es el módulo principal para que luego podamos llamar a la función ``main``.

source: Als nächstes erstellen wir eine Zeile ``if __name__ == '__main__':`` in der **app.py** Datei.
es: A continuación, creamos una línea ``if __name__ == '__main__':`` en el archivo **app.py**.

source: Um eine neue "decore" Anwendungsinstanz zu erstellen, benutzen wir eine mit ``@decore.app`` dekorierte ``main()`` Funktion in der **app.py** Datei, direkt unter der Zeile: ``if __name__ == '__main__':``.
es: Para crear una nueva instancia de aplicación "decore", utilizamos una función ``main()`` decorada con ``@decore.app`` en el archivo **app.py**, justo debajo de la línea: ``if __name__ == '__main__':``.

source: Model
es: Modelo

source: In einem Modell legen wir die Datenfelder fest, die später einer Basis zugeordnet werden muss. Es dient als Datenbankschnittstelle zu den Datenbanktreibern wie SQLite, MySQL, PostgreSQL, etc.
es: En un modelo se definen los campos de datos que posteriormente deben asignarse a una base. Sirve de interfaz de base de datos para los controladores de bases de datos como SQLite, MySQL, PostgreSQL, etc.

source: Wir erstellen nun die Datei first_model.py im Verzeichnis **models** und fügen den folgenden Code ein:
es: Ahora creamos el archivo first_model.py en el directorio **models** e insertamos el siguiente código:

source: Es muss nicht für jede Basis ein Modell angelegt werden aber es muss jedes zu verwenden Modell eine Basis haben, die über die Datei **__init__.py**, importiert werden muss. Nur so werden Rellationen zwischen den Modellen auch im Frontend ausgewertet und dargestellt.
es: No es necesario crear un modelo para cada base, pero cada modelo a utilizar debe tener una base, que debe ser importada a través del fichero **__init__.py**. Esta es la única manera de evaluar y mostrar las rellaciones entre los modelos en el frontend.

source: Um mögliche zirkuläre Importe zu vermeiden, legen wir die Modellklassen in einem eigenen Verzeichnis **models** in unserem Projektstammverzeichnis an. Das Verzeichnis **models** wurde durch den zuvor ausgeführten Befehl ``python app.py --prepare`` erstellt.
es: Para evitar posibles importaciones circulares, creamos las clases modelo en un directorio **models** separado en el directorio raíz de nuestro proyecto. El directorio **models** fue creado por el comando ``python app.py --prepare`` ejecutado previamente.

source: In dem hier gezeigten Beispiel importieren wir aus der **uniform library** die Klasse Conform_model und erweitern sie um die Felder Vorname und Nachname.
es: En el ejemplo que se muestra aquí, importamos la clase Conform_model de la **biblioteca uniforme** y la ampliamos con los campos nombre y apellidos.

source: Die Modelle in **decore Base** basieren auf dem großartigen Peewee ORM. Um mehr über Peewee zu erfahren, besuchen Sie `Peewee ORM <http://docs.peewee-orm.com/en/latest/>`_.
es: Los modelos de **decore Base** se basan en el gran Peewee ORM. Para saber más sobre Peewee, visita `Peewee ORM <http://docs.peewee-orm.com/en/latest/>`_.

source: Beim Importieren ist zu beachten, dass wir alles (*) aus dem conform_model Namespace importieren, um auch die Feldklassen zu erhalten.
es: Al importar, tenga en cuenta que importamos todo (*) del espacio de nombres conform_model para obtener también las clases de campo.

source: Die Basisklassen dienen der decore-Anwendung als Trägerelement für die View-Komponenten, pflegen das Datenmodell ein und gelten damit auch als Datenquelle für die Auswertung im Frontend des Dashboards.
es: Las clases base sirven a la aplicación decore como elemento portador de los componentes de la vista, mantienen el modelo de datos y, por tanto, son también la fuente de datos para el análisis en el front-end del cuadro de mando.

source: Nun müssen wir ein neues Python-Modul erstellen, das z.B. eine Basisklasse enthält: **first_base.py**, im Verzeichnis **bases** in unserem Projektstammverzeichnis. Das Verzeichnis **bases** wurde durch den zuvor ausgeführten Befehl ``python app.py --prepare`` miterzeugt.
es: Ahora necesitamos crear un nuevo módulo Python que contenga una clase base, por ejemplo: **primera_base.py**, en el directorio **bases** del directorio raíz de nuestro proyecto. El directorio **bases** fue creado por el comando ``python app.py --prepare`` ejecutado previamente.

source: Um das zuvor erstellte Modell zu verwenden, importieren wir es in die Base-Klasse und übergeben es an den Parameter ``model``.
es: Para utilizar el modelo creado previamente, lo importamos a la clase Base y lo pasamos al parámetro ``model``.

source: In order for the Python interpreter to be able to process the base classes, we have to import them into the __init__.py file in the **bases** directory. The order of the individual imports also determines the order in **decore Front**.
es: Para que el intérprete de Python pueda procesar las clases base, tenemos que importarlas en el archivo __init__.py en el directorio **bases**. El orden de las importaciones individuales también determina el orden en **decore Front**.

source: We edit the **__init__.py** file and insert the following code:
es: Editamos el fichero **__init__.py** e insertamos el siguiente código:

source: Views werden von der decore-Anwendung verwendet, um die Datensätze im Frontend der Webanwendung zu präsentieren.
es: Las vistas son utilizadas por la aplicación decore para presentar los registros de datos en el front-end de la aplicación web.

source: Mit dem View-Decorator können wir nun eine Ansichts-Komponente erstellen und sie, unter der zuvor erstellten Basisklasse, einhängen.
es: Con el decorador de vista, ahora podemos crear un componente de vista y adjuntarlo bajo la clase base creada anteriormente.

source: Wir bearbeiten nun die Datei **first_base.py** erneut und erweitern den Code wie folgt:
es: Ahora editamos de nuevo el archivo **first_base.py** y ampliamos el código de la siguiente manera:

source: Dialoge sind die unterstützenden Elemente für Widgets im Frontend der Webanwendung. Sie können Ansichten aber auch untergeordneten Widgets hinzugefügt werden und steuern die Sichtbarkeit und den Anzeigestil von Kindelementen. Dialoge erhalten auch die Kontrolle über die Sendefunktionen der Widgets.
es: Los diálogos son los elementos de soporte para los widgets en el front-end de la aplicación web. Pueden añadirse tanto a las vistas como a los widgets subordinados y controlan la visibilidad y el estilo de visualización de los elementos hijos. Los diálogos también tienen control sobre las funciones de envío de los widgets.

source: In unserem Fall erstellen wir einen Dialog, um eine neue Person mit Vornamen und Nachnamen anzulegen.
es: En nuestro caso, creamos un diálogo para crear una nueva persona con nombre y apellidos.

source: Hier gehen wir ... wieder die Datei **first_base.py** und erweitern den Code wie folgt:
es: Aquí vamos ... el archivo **first_base.py** de nuevo y ampliar el código de la siguiente manera:

source: Widgets sind Komponenten, mit denen wir Interaktionen mit dem einzelnen Datensatz durchführen können. Sie können nur zu Dialogen hinzugefügt werden und sind stapelbar.
es: Los widgets son componentes con los que podemos interactuar con el conjunto de datos individuales. Sólo se pueden añadir a los diálogos y son apilables.

source: Was wir jetzt brauchen, ist ein Eingabeformular, um die Daten für die neue Person einzugeben.
es: Lo que necesitamos ahora es un formulario de entrada para introducir los datos de la nueva persona.

source: Actions sind Methoden, mit das Frontend mit **decore Base** kommunizieren kann. Sie können zu View und Widgets hinzugefügt werden und sind die einzigen echten Klassenmethoden und werden direkt in der Basis aufgerufen.
es: Las acciones son métodos con los que el frontend puede comunicarse con **decore Base**. Se pueden añadir a las vistas y widgets y son los únicos métodos reales de la clase y se llaman directamente en la base.

source: Wir brauchen nun eine Aktion, um die Daten der neuen Person zu speichern und erweitern den Code in **first_base.py** wie folgt:
es: Ahora necesitamos una acción para guardar los datos de la nueva persona y ampliar el código en **first_base.py** de la siguiente manera:

source: Um einen Datensatz mit decore Base zu erstellen, müssen wir eine Instanz des Modells erstellen. In unserem Fall **First_model**. Die Instanz wird mit den Daten aus dem Formular gefüllt und dann gespeichert.
es: Para crear un conjunto de datos con decore Base, necesitamos crear una instancia del modelo. En nuestro caso **Primer_modelo**. La instancia se rellena con los datos del formulario y luego se guarda.

source: Die ID, in Form einer UUID im Textformat, wird automatisch generiert und muss nicht gesondert angegeben werden.
es: El ID, en forma de UUID en formato de texto, se genera automáticamente y no es necesario especificarlo por separado.

source: Das Feld **titel** muss bei jeder Datensatzerstellung verwendet werden. Andernfalls wird das Element die Validierung nicht bestehen. Es sollte ausserdem immer eindeutig sein, also keine gleichen Titel in der Datenbank geben.
es: El campo **título** debe utilizarse cada vez que se cree un registro de datos. De lo contrario, el elemento no pasará la validación. También debe ser siempre único, es decir, no debe haber títulos idénticos en la base de datos.

source: Ausführung, Entwicklung und Erstellung
es: Ejecución, desarrollo y creación

source: Ausführung
es: Ejecución

source: Um Ihre Anwendung zu starten, führen Sie ``python app.py`` in Ihrem Projekt-Stammverzeichnis aus. Verwenden Sie das Terminal in vscode.
es: Para iniciar su aplicación, ejecute ``python app.py`` en el directorio raíz de su proyecto. Utilice el terminal en vscode.

source: Öffnen Sie den Browser und geben Sie ``http://localhost:5555`` ein.
es: Abra el navegador e introduzca ``http://localhost:5555``.

source: Entwicklung
es: Desarrollo

source: Um Ihre Anwendung zu entwickeln, verwenden Sie Ihren Debugger mit dem Profil ``[dev] decore base development`` in vscode.
es: Para desarrollar su aplicación, utilice su depurador con el perfil ``[dev] decore base development`` en vscode.

source: Erstellung
es: Creación

source: Um Ihre Anwendung zu erstellen, führen Sie ``python app.py --build`` in Ihrem Projekt-Stammverzeichnis aus. Verwenden Sie das Terminal in vscode.
es: Para construir su aplicación, ejecute ``python app.py --build`` en el directorio raíz de su proyecto. Utilice el terminal en vscode.

source: Typen
es: Tipos

source: Ansicht
es: Ver

source: Tabelle
es: Cuadro

source: Der Ansichtstyp Tabelle dient der tabellarischen Darstellung von Daten.
es: El tipo de vista Tabla se utiliza para mostrar datos en forma de tabla.

source: Features
es: Características

source: Decore ist eine Biblitothek zur Erstellung von Gui-Dashboard-Anwendungen in Python die ein vielzahl an Eigenschaften hervorbringt und auch in zukunft stetig erweitert wird.
es: Decore es una librería para la creación de aplicaciones Gui dashboard en Python que proporciona una gran variedad de funcionalidades y que será ampliada continuamente en el futuro.

source: Durch die Verbindung einiger wirklich guter Python-Pakete war die Arbeit an decore überhaupt erst möglich. Daher möchte ich mich an dieser Stelle bei den Entwicklern der folgenden Pakete bedanken:
es: Trabajar en decore sólo ha sido posible gracias a la combinación de algunos paquetes de Python realmente buenos. Por ello, me gustaría aprovechar esta oportunidad para dar las gracias a los desarrolladores de los siguientes paquetes:

source: **Peewee** - Ein einfaches, aber leistungsstarkes ORM, das eine flexible Datenbankanbindung für Python bietet. http://docs.peewee-orm.com/en/latest/index.html
es: **Peewee** - Un ORM sencillo pero potente que proporciona una conexión flexible a bases de datos para Python. http://docs.peewee-orm.com/en/latest/index.html

source: **Flask** - Ein Microframework für Python basierend auf Werkzeug, Jinja 2 und guter Absichten. http://flask.pocoo.org/
es: **Flask** - Un microframework para Python basado en Werkzeug, Jinja 2 y buenas intenciones. http://flask.pocoo.org/

source: **Quasar** - Ein Vue.js basiertes Frontend-Framework. https://quasar-framework.org/
es: **Quasar** - Un marco frontend basado en Vue.js. https://quasar-framework.org/

source: **Vue.js** - Ein progressiver, inkrementeller JavaScript-Framework für die Entwicklung von Benutzeroberflächen. https://vuejs.org/
es: **Vue.js** - Un marco JavaScript progresivo e incremental para el desarrollo de interfaces de usuario. https://vuejs.org/

source: **Cerberus** - Eine Validierungs-Bibliothek für Python-Datenstrukturen. http://docs.python-cerberus.org/en/stable/
es: **Cerberus** - Biblioteca de validación de estructuras de datos en Python. http://docs.python-cerberus.org/en/stable/

source: **pykeepass** - Eine Bibliothek zum interagieren von KeePass 1.x und 2.x Datenbanken. http://pykeepass.readthedocs.io/en/latest/
es: **pykeepass** - Una biblioteca para interactuar con las bases de datos KeePass 1.x y 2.x. http://pykeepass.readthedocs.io/en/latest/

source: Die nun folgenden Feature- und Änderungs-Aufzählungen sind in decore Base enthalten.
es: Las siguientes listas de características y cambios se encuentran en decore Base.

source: Management & Backend-Anwendung
es: Gestión y aplicación backend

source: schnelle und einfache GUI-Dashboard-Anwendungs Entwicklung mittels Python Decorators.
es: Desarrollo rápido y sencillo de aplicaciones GUI para cuadros de mando utilizando decoradores de Python.

source: Erhaltung des Objekt-Orientierten Programmierstils in den Basisklassen, durch Aktionsufruf als Instanzmethoden.
es: Preservación del estilo de programación orientado a objetos en las clases base, llamando a las acciones como métodos de instancia.

source: Speichung von wiederverwendbaren Kennwörtern (**keine Benutzerkennwörter**) in einer KeePass-Datenbank (**Hier wird noch ein Sicherheitsleitfaden erstellt**).
es: Almacenamiento de contraseñas reutilizables (**no contraseñas de usuario**) en una base de datos KeePass (**aquí aún se está creando una guía de seguridad**).

source: Fortschrittsmitteilung an das Frontend durch das Actor-Modul.
es: Notificación de progreso al front end por parte del módulo actor.

source: ORM Erweiterung & Datenbankanbindung
es: Extensión ORM y conexión a bases de datos
