Repository: KemoPanzah/decore_Page_Old
Catalog: source/_locale/*/LC_MESSAGES/docs.po
Languages: es

source: Einfache Datensatzereugung mit angepasster aber vereinfachter Peewee-Integration.
es: Creación sencilla de registros de datos con integración personalizada pero simplificada de Peewee.

source: Derzeit Mögliche Datenbank-Schnittstellen: SQLite ... (**Hier kommt schon bald mehr** ).
es: Interfaces de base de datos posibles actualmente: SQLite ... (**más en breve** ).

source: Relationale Datenbank-Abfragen mit einer eigenen ``query`` Methode in im decore Model.
es: Consultas a bases de datos relacionales con un método ``query`` independiente en el modelo decore.

source: Semi-Automatische Datensatzerstellung bei Aktionsverwendung durch das Actor-Modul.
es: Creación semiautomática de registros de datos cuando el módulo Actor utiliza acciones.

source: Intergrierte Feldattribut definierte Standard-Validierung beim speichern eines Datensatzes.
es: Validación estándar definida por atributo de campo integrada al guardar un registro de datos.

source: Webanwendung (SPA)
es: Aplicación web (SPA)

source: Automatische und generische Erzeugung der GUI-Dashboard-Komponenten anhand der erfassten Metadaten.
es: Generación automática y genérica de los componentes del cuadro de mandos de la interfaz gráfica de usuario a partir de los metadatos recopilados.

source: Vorgefertigtes Layout, reagierende Navigationsleiste und Basisbreich für die Ansicht-Komponenten.
es: Diseño prefabricado, barra de navegación responsiva y área básica para los componentes de la vista.

source: Dialogsteuerung durch URL-Navigation
es: Control del diálogo mediante navegación por URL

source: Erzeugung eines relationalen Datensatzes für die weiterverwenung im Widget.
es: Creación de un conjunto de datos relacionales para su uso posterior en el widget.

source: Sample
es: Muestra

source: index, follow
es: índice, siga

source: Einleitung
es: Introducción

source: decore Base ist ein out-of-the-box "Python to Vue.js" Datenanwendungs-Dashboard, das Ihnen hilft, in wenigen einfachen Schritten von der Idee zur Ansicht zu gelangen. Es richtet sich an diejenigen, die sich auf die Ergebnisse ihrer Algorithmen konzentrieren wollen, wissenschaftliche Arbeit leisten oder Lehr- und Lernfunktionen ausführen wollen.
es: decore Base es un panel de aplicaciones de datos "Python to Vue.js" listo para usar que te ayuda a pasar de la idea a la vista en unos sencillos pasos. Está dirigido a quienes desean centrarse en los resultados de sus algoritmos, realizar trabajos científicos o desempeñar funciones de enseñanza y aprendizaje.

source: **decore Base ist derzeit in Arbeit, nur lokal bereitstellbar, nur für Windows verfügbar und noch nicht produktionsbereit**.
es: **decore Base es actualmente un trabajo en curso, sólo disponible a nivel local, sólo disponible para Windows y aún no está listo para la producción**.

source: Die empfohlene IDE ist Visual Studio Code und alle Kommentare, Beschreibungen und Dokumentationen beziehen sich vorerst auch nur auf vscode.
es: El IDE recomendado es Visual Studio Code y todos los comentarios, descripciones y documentación se refieren sólo a vscode por el momento.

source: Entwicklungsphasen & Vorteile
es: Fases de desarrollo y ventajas

source: decore Base wurde entworfen um den Entwicklungsprozess deiner Anwendung in seinen verschiedenen Phasen optimal zu unterstützen.
es: decore Base se ha diseñado para apoyar de forma óptima el proceso de desarrollo de su aplicación en sus distintas fases.

source: ** Einige der hier genannten Funktionen sind derzeit noch in direkter Entwicklung und werden in Kürze verfügbar sein.
es: ** Algunas de las funciones aquí mencionadas están aún en desarrollo directo y estarán disponibles en breve.

source: Beteiligung & Unterstützung
es: Participación y apoyo

source: Die größte Hilfe, die ich im Moment bekommen kann, ist, wenn Sie einen Blick auf das Projekt werfen und mir sagen, was Sie davon halten. Ich bin für jede Kritik dankbar.
es: La mayor ayuda que puedo recibir en este momento es que eches un vistazo al proyecto y me digas qué te parece. Agradezco cualquier crítica.

source: Sollte bei Entwickeln etwas nicht wie erwartet funktionieren oder Unklarheiten in der Dokumentation auftauchen, lassen Sie es mich bitte wissen.
es: Si algo no funciona como se esperaba durante el desarrollo o si hay alguna ambigüedad en la documentación, hágamelo saber.

source: Bitte benutzen Sie dazu den Problembereich im Repository. `<https://github.com/KemoPanzah/decore_Base/issues>`_
es: Por favor, utilice el área de problemas en el repositorio. `<https://github.com/KemoPanzah/decore_Base/issues>`_

source: Sample application
es: Ejemplo de solicitud

source: To better understand how decore base works, it is best to look at the sample application. The application represents my continuous development of decore base.
es: Para entender mejor cómo funciona decore base, lo mejor es echar un vistazo a la aplicación de ejemplo. La aplicación representa mi desarrollo continuo de decore base.
